namespace GTA5OnlineTools.Features.Data;

public enum VehicleModType
{
    Spoilers = 0,
    FrontBumper = 1,
    RearBumper = 2,
    SideSkirt = 3,
    Exhaust = 4,
    Frame = 5,
    Grille = 6,
    Hood = 7,
    Fender = 8,
    RightFender = 9,
    Roof = 10,
    Engine = 11,
    Brakes = 12,
    Transmission = 13,
    Horns = 14,
    Suspension = 15,
    Armor = 16,
    FrontWheel = 23,
    RearWheel = 24,
    PlateHolder = 25,
    VanityPlates = 26,
    TrimDesign = 27,
    Ornaments = 28,
    Dashboard = 29,
    DialDesign = 30,
    DoorSpeakers = 31,
    Seats = 32,
    SteeringWheels = 33,
    ColumnShifterLevers = 34,
    Plaques = 35,
    Speakers = 36,
    Trunk = 37,
    Hydraulics = 38,
    EngineBlock = 39,
    AirFilter = 40,
    Struts = 41,
    ArchCover = 42,
    Aerials = 43,
    Trim = 44,
    Tank = 45,
    Windows = 46,
    Doors = 47,
    Livery = 48
}

public static class VehicleData
{
    public struct VehicleClass
    {
        public string ClassName;
        public List<VehicleInfo> VehicleInfo;
    }

    public struct VehicleInfo
    {
        public string Name;
        public string DisplayName;
        public uint Hash;
        public int[] Mod;
    }

    /// <summary>
    /// ★常用载具
    /// </summary>
    public static List<VehicleInfo> CommonVehicle = new()
    {
        new VehicleInfo(){ Name="Oppressor2", DisplayName="佩嘉西 暴君 Mk 2", Hash=2069146067, Mod=new int[43]{ 0,0,0,0,0,1,2,0,0,0,2,4,3,0,0,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30 } },
        new VehicleInfo(){ Name="Kuruma2", DisplayName="卡林 骷髅马（装甲版）", Hash=410882957, Mod=new int[43]{ 5,3,0,6,3,1,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15 } },
        new VehicleInfo(){ Name="Police3", DisplayName="警用巡逻车", Hash=1912215274, Mod=new int[43]{ 2,2,2,2,1,2,0,2,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Ambulance", DisplayName="救护车", Hash=1171614426, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Buzzard", DisplayName="秃鹰攻击直升机", Hash=788747387, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dodo", DisplayName="巨象 嘟嘟鸟", Hash=3393804037, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Sanchez", DisplayName="麦霸子 桑切斯（涂装版）", Hash=788045382, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Rhino", DisplayName="犀牛坦克", Hash=782665360, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 0 当前分类: 小型汽车
    /// </summary>
    public static List<VehicleInfo> Compacts = new()
    {
        new VehicleInfo(){ Name="Asbo", DisplayName="麦克斯韦 反社会", Hash=1118611807, Mod=new int[43]{ 15,6,0,12,8,4,2,11,4,4,6,4,3,3,58,4,5,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Blista", DisplayName="丁卡 旅行家", Hash=3950024287, Mod=new int[43]{ 0,1,1,1,1,0,0,1,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Brioso", DisplayName="古罗帝 精力霸 R/A", Hash=1549126457, Mod=new int[43]{ 2,3,1,0,0,0,0,3,0,0,3,4,3,3,58,3,5,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="Brioso2", DisplayName="古罗帝 精力霸 300", Hash=1429622905, Mod=new int[43]{ 4,7,4,3,5,1,0,2,3,2,11,4,3,3,58,5,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Brioso3", DisplayName="古罗帝 精力霸 300 宽体版", Hash=15214558, Mod=new int[43]{ 13,11,7,3,5,5,7,11,8,6,14,4,3,3,58,5,5,36,0,0,0,10,0,5,0,8,14,16,0,0,0,11,0,8,0,0,9,0,0,0,0,0,18 } },
        new VehicleInfo(){ Name="Club", DisplayName="毕福 俱乐部", Hash=2196012677, Mod=new int[43]{ 10,8,5,2,9,6,5,8,2,6,5,4,3,3,58,4,5,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,14 } },
        new VehicleInfo(){ Name="Dilettante", DisplayName="卡林 半吊子", Hash=3164157193, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,0,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dilettante2", DisplayName="卡林 半吊子", Hash=1682114128, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,0,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Issi2", DisplayName="威尼 天威", Hash=3117103977, Mod=new int[43]{ 0,1,1,1,1,0,0,1,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Issi3", DisplayName="威尼 天威经典版", Hash=931280609, Mod=new int[43]{ 9,9,5,8,9,6,9,13,12,6,6,4,3,3,58,3,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Issi4", DisplayName="威尼 末日天威", Hash=628003514, Mod=new int[43]{ 3,3,0,2,4,3,4,13,3,5,1,4,3,4,58,5,5,50,0,0,11,0,4,0,0,0,0,0,0,8,0,0,0,0,4,3,3,1,0,2,0,0,4 } },
        new VehicleInfo(){ Name="Issi5", DisplayName="威尼 科幻天威", Hash=1537277726, Mod=new int[43]{ 5,5,4,8,6,3,4,13,8,5,1,4,3,4,58,5,5,50,0,0,0,0,8,4,0,0,0,0,0,0,0,0,0,0,4,3,3,1,0,2,0,0,18 } },
        new VehicleInfo(){ Name="Issi6", DisplayName="威尼 梦魇天威", Hash=1239571361, Mod=new int[43]{ 3,3,0,2,4,3,4,12,3,5,1,4,3,4,58,5,5,50,0,0,11,0,4,0,0,0,0,0,0,8,0,0,0,0,4,3,3,1,0,2,0,0,4 } },
        new VehicleInfo(){ Name="Kanjo", DisplayName="丁卡 旅行家羽黑", Hash=409049982, Mod=new int[43]{ 18,12,13,7,11,6,7,15,9,4,6,4,3,3,58,4,5,48,0,0,0,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,6,0,0,0,3,0,13 } },
        new VehicleInfo(){ Name="Panto", DisplayName="贝飞特 哑剧", Hash=3863274624, Mod=new int[43]{ 5,4,2,4,5,1,3,0,2,0,4,4,3,3,58,5,5,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Prairie", DisplayName="包洛坎 原野行者", Hash=2844316578, Mod=new int[43]{ 6,7,2,7,6,0,0,9,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Rhapsody", DisplayName="绝致 狂想曲", Hash=841808271, Mod=new int[43]{ 1,1,0,0,3,0,0,3,3,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Weevil", DisplayName="毕福 象鼻虫", Hash=1644055914, Mod=new int[43]{ 5,16,8,6,11,7,1,5,9,6,16,4,3,3,58,5,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15 } },
    };

    /// <summary>
    /// 1 当前分类: 轿车
    /// </summary>
    public static List<VehicleInfo> Sedans = new()
    {
        new VehicleInfo(){ Name="Asea", DisplayName="绝致 海致", Hash=2485144969, Mod=new int[43]{ 1,4,0,0,1,0,0,3,1,1,2,4,3,3,58,4,5,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Asea2", DisplayName="绝致 海致", Hash=2487343317, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Asterope", DisplayName="卡林 爱硕普", Hash=2391954683, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cinquemila", DisplayName="兰帕达缇 五千", Hash=2767531027, Mod=new int[43]{ 17,14,4,14,8,3,7,17,3,2,11,5,4,4,58,3,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Cog55", DisplayName="埃努斯 至尊慧眼 55", Hash=906642318, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cog552", DisplayName="埃努斯 至尊慧眼 55（装甲版）", Hash=704435172, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cognoscenti", DisplayName="埃努斯 至尊慧眼", Hash=2264796000, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cognoscenti2", DisplayName="埃努斯 至尊慧眼（装甲版）", Hash=3690124666, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Deity", DisplayName="埃努斯 神灵", Hash=1532171089, Mod=new int[43]{ 18,8,5,12,11,1,11,13,3,1,9,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,1,0,0,12 } },
        new VehicleInfo(){ Name="Emperor", DisplayName="亚班尼 皇霸天", Hash=3609690755, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Emperor2", DisplayName="亚班尼 皇霸天", Hash=2411965148, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Emperor3", DisplayName="亚班尼 皇霸天", Hash=3053254478, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Fugitive", DisplayName="雪佛 流星", Hash=1909141499, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Glendale", DisplayName="贝飞特 格伦戴尔", Hash=75131841, Mod=new int[43]{ 3,1,0,1,3,0,0,5,0,0,3,4,3,3,58,6,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Glendale2", DisplayName="贝飞特 格伦戴尔改装版", Hash=3381377750, Mod=new int[43]{ 3,0,0,0,8,0,0,10,0,0,3,4,3,3,58,0,5,30,4,13,16,12,45,0,14,0,0,16,15,22,4,5,5,6,0,0,0,0,0,2,0,0,10 } },
        new VehicleInfo(){ Name="Ingot", DisplayName="福狮 英卡特", Hash=3005245074, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Intruder", DisplayName="卡林 入侵者", Hash=886934177, Mod=new int[43]{ 1,1,1,1,1,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Limo2", DisplayName="贝飞特 武装礼车", Hash=4180339789, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Premier", DisplayName="绝致 统领", Hash=2411098011, Mod=new int[43]{ 1,1,0,1,2,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Primo", DisplayName="亚班尼 初代", Hash=3144368207, Mod=new int[43]{ 2,1,1,1,3,0,3,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Primo2", DisplayName="亚班尼 初代改装版", Hash=2254540506, Mod=new int[43]{ 2,4,1,1,4,0,5,3,0,0,0,4,3,3,58,0,5,50,4,13,16,4,45,0,7,0,0,16,15,22,4,7,4,6,5,0,0,4,3,3,0,0,9 } },
        new VehicleInfo(){ Name="Regina", DisplayName="敦追里 女皇", Hash=4280472072, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Rhinehart", DisplayName="绝品 莱茵哈特", Hash=2439462158, Mod=new int[43]{ 8,8,8,9,9,5,6,12,8,0,17,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Romero", DisplayName="烈火马 钢骨灵车", Hash=627094268, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Schafter2", DisplayName="贝飞特 莎夫特", Hash=3039514899, Mod=new int[43]{ 3,2,1,2,4,0,2,3,0,0,1,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Schafter5", DisplayName="贝飞特 莎夫特 V12（装甲版）", Hash=3406724313, Mod=new int[43]{ 3,3,1,2,4,0,0,3,0,0,1,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Schafter6", DisplayName="贝飞特 长轴莎夫特（装甲版）", Hash=1922255844, Mod=new int[43]{ 3,3,1,2,4,0,0,3,0,0,1,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Stafford", DisplayName="埃努斯 斯塔福德", Hash=321186144, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,4,58,3,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Stanier", DisplayName="威皮 史塔尼亚", Hash=2817386317, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Stratum", DisplayName="赛柯尼 地层先锋", Hash=1723137093, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Stretch", DisplayName="敦追里 加长型礼车", Hash=2333339779, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Superd", DisplayName="埃努斯 金钻耀星", Hash=1123216662, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Surge", DisplayName="雪佛 奔腾", Hash=2400073108, Mod=new int[43]{ 1,1,1,1,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tailgater", DisplayName="奥北 密探", Hash=3286105550, Mod=new int[43]{ 5,4,4,4,4,0,5,6,2,0,2,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tailgater2", DisplayName="奥北 密探 S", Hash=3050505892, Mod=new int[43]{ 28,15,11,19,8,6,3,23,4,3,3,4,3,3,58,4,5,40,0,3,2,3,0,2,0,1,14,17,0,0,0,0,0,5,9,12,3,6,13,3,0,2,15 } },
        new VehicleInfo(){ Name="Warrener", DisplayName="福狮 守护星", Hash=1373123368, Mod=new int[43]{ 4,3,2,2,4,1,4,2,2,0,0,4,3,3,58,4,5,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Warrener2", DisplayName="福狮 守护星 HKR", Hash=579912970, Mod=new int[43]{ 8,10,2,0,8,5,3,7,2,0,3,4,3,3,58,4,5,48,0,0,6,8,0,5,4,9,14,16,0,0,0,0,0,4,4,12,2,4,6,5,0,11,15 } },
        new VehicleInfo(){ Name="Washington", DisplayName="亚班尼 华盛顿", Hash=1777363799, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 2 当前分类: SUV
    /// </summary>
    public static List<VehicleInfo> SUVs = new()
    {
        new VehicleInfo(){ Name="Astron", DisplayName="菲斯特 宇航", Hash=629969764, Mod=new int[43]{ 9,8,8,9,5,15,3,15,2,0,2,5,4,4,58,3,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Baller", DisplayName="悠游 行者", Hash=3486135912, Mod=new int[43]{ 0,2,1,1,1,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Baller2", DisplayName="悠游 行者", Hash=142944341, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Baller3", DisplayName="悠游 行者 LE", Hash=1878062887, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Baller4", DisplayName="悠游 长轴行者 LE", Hash=634118882, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Baller5", DisplayName="悠游 行者 LE（装甲版）", Hash=470404958, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Baller6", DisplayName="悠游 长轴行者 LE（装甲版）", Hash=666166960, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Baller7", DisplayName="悠游 行者 ST", Hash=359875117, Mod=new int[43]{ 6,4,1,2,7,2,5,7,2,1,8,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,13 } },
        new VehicleInfo(){ Name="BJXL", DisplayName="卡林 碧杰 XL", Hash=850565707, Mod=new int[43]{ 0,1,0,1,0,0,0,0,0,0,1,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cavalcade", DisplayName="亚班尼 骑兵", Hash=2006918058, Mod=new int[43]{ 0,2,0,1,1,1,2,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cavalcade2", DisplayName="亚班尼 骑兵", Hash=3505073125, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Contender", DisplayName="威皮 争夺者", Hash=683047626, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dubsta", DisplayName="贝飞特 迪布达", Hash=1177543287, Mod=new int[43]{ 1,6,2,2,2,0,3,2,1,0,4,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dubsta2", DisplayName="贝飞特 迪布达", Hash=3900892662, Mod=new int[43]{ 0,2,0,0,2,0,0,2,1,0,2,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="FQ2", DisplayName="深水 FQ 2", Hash=3157435195, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Granger", DisplayName="绝致 屌王", Hash=2519238556, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Granger2", DisplayName="绝致 屌王 3600LX", Hash=4033620423, Mod=new int[43]{ 2,2,3,3,8,1,4,7,3,1,2,4,3,3,58,4,5,38,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,1,0,0,12 } },
        new VehicleInfo(){ Name="Gresley", DisplayName="冒险家 情欲猎手", Hash=2751205197, Mod=new int[43]{ 0,1,1,1,1,0,0,1,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Habanero", DisplayName="皇霸天 哈拔尼禄", Hash=884422927, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Huntley", DisplayName="埃努斯 亨特利 S", Hash=486987393, Mod=new int[43]{ 0,0,0,0,4,0,0,4,0,0,1,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="IWagen", DisplayName="奥北 爱瓦根", Hash=662793086, Mod=new int[43]{ 3,6,6,0,0,0,0,7,0,0,0,4,3,0,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Jubilee", DisplayName="埃努斯 吉伯力", Hash=461465043, Mod=new int[43]{ 2,15,9,17,6,1,0,17,0,1,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,1,0,0,9 } },
        new VehicleInfo(){ Name="Landstalker", DisplayName="敦追里 追捕者", Hash=1269098716, Mod=new int[43]{ 0,1,0,1,1,0,0,0,0,0,1,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Landstalker2", DisplayName="敦追里 追捕者 XL", Hash=3456868130, Mod=new int[43]{ 0,5,3,8,7,0,6,7,0,2,6,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Mesa", DisplayName="卡尼斯 炎魔", Hash=914654722, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Mesa2", DisplayName="卡尼斯 炎魔", Hash=3546958660, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Novak", DisplayName="兰帕达缇 诺瓦克", Hash=2465530446, Mod=new int[43]{ 8,5,4,4,4,0,0,8,0,0,2,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Patriot", DisplayName="巨象 爱国者", Hash=3486509883, Mod=new int[43]{ 0,2,2,0,2,0,0,3,0,0,1,4,3,3,58,3,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30 } },
        new VehicleInfo(){ Name="Patriot2", DisplayName="巨象 爱国者加长型", Hash=3874056184, Mod=new int[43]{ 0,2,2,0,3,0,0,8,0,2,0,4,3,3,58,3,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30 } },
        new VehicleInfo(){ Name="Radi", DisplayName="威皮 辐光", Hash=2643899483, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Rebla", DisplayName="绝品 瑞巴 GTS", Hash=83136452, Mod=new int[43]{ 8,8,3,8,7,5,9,13,7,2,2,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Rocoto", DisplayName="奥北 小辣椒", Hash=2136773105, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Seminole", DisplayName="卡尼斯 陆上专家", Hash=1221512915, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Seminole2", DisplayName="卡尼斯 陆上专家边境", Hash=2484160806, Mod=new int[43]{ 3,9,1,2,5,4,6,8,5,1,7,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Serrano", DisplayName="贝飞特 瑟雷诺", Hash=1337041428, Mod=new int[43]{ 1,1,1,1,2,0,1,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Squaddie", DisplayName="巨象 列兵", Hash=4192631813, Mod=new int[43]{ 13,13,8,14,9,5,19,14,7,16,9,4,3,3,58,5,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,20 } },
        new VehicleInfo(){ Name="Toros", DisplayName="佩嘉西 奔牛", Hash=3126015148, Mod=new int[43]{ 8,9,4,6,12,0,14,12,1,0,8,4,3,4,58,5,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="XLS", DisplayName="贝飞特 XLS", Hash=1203490606, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="XLS2", DisplayName="贝飞特 XLS(装甲版)", Hash=3862958888, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 3 当前分类: 轿跑车
    /// </summary>
    public static List<VehicleInfo> Coupes = new()
    {
        new VehicleInfo(){ Name="CogCabrio", DisplayName="埃努斯 至尊慧眼敞篷版", Hash=330661258, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Exemplar", DisplayName="浪子 典范", Hash=4289813342, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="F620", DisplayName="欧斯洛 F620", Hash=3703357000, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Felon", DisplayName="兰帕达缇 恶龙", Hash=3903372712, Mod=new int[43]{ 1,1,1,1,1,0,0,1,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Felon2", DisplayName="兰帕达缇 恶龙 GT", Hash=4205676014, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,3,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Jackal", DisplayName="欧斯洛 胡狼", Hash=3670438162, Mod=new int[43]{ 2,1,1,1,1,0,0,2,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="KanjoSJ", DisplayName="丁卡 羽黑 SJ", Hash=4230891418, Mod=new int[43]{ 18,7,9,9,7,8,15,16,6,3,6,4,3,3,58,4,5,50,0,0,0,3,0,5,0,8,15,16,0,0,0,0,0,6,4,20,0,6,8,0,0,8,15 } },
        new VehicleInfo(){ Name="Oracle", DisplayName="绝品 先知 XS", Hash=1348744438, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Oracle2", DisplayName="绝品 先知", Hash=3783366066, Mod=new int[43]{ 0,0,0,0,3,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Postlude", DisplayName="丁卡 后奏", Hash=4000288633, Mod=new int[43]{ 13,5,5,0,18,5,0,19,5,0,8,4,3,3,58,4,5,48,0,0,7,3,0,5,0,7,14,16,0,0,0,0,0,6,0,15,5,0,0,0,4,5,13 } },
        new VehicleInfo(){ Name="Previon", DisplayName="卡林 普莱温", Hash=1416471345, Mod=new int[43]{ 10,4,2,5,7,5,5,12,2,2,2,4,3,3,58,4,5,50,0,0,8,8,0,4,4,8,14,16,0,0,0,0,0,4,25,20,9,6,0,0,5,2,15 } },
        new VehicleInfo(){ Name="Sentinel", DisplayName="绝品 卫士 XS", Hash=1349725314, Mod=new int[43]{ 4,2,2,1,3,1,0,1,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Sentinel2", DisplayName="绝品 卫士", Hash=873639469, Mod=new int[43]{ 4,1,1,1,3,0,0,1,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Windsor", DisplayName="埃努斯 温莎", Hash=1581459400, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Windsor2", DisplayName="埃努斯 温莎敞篷版", Hash=2364918497, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Zion", DisplayName="绝品 绝品天堂", Hash=3172678083, Mod=new int[43]{ 3,0,0,0,4,1,0,1,0,0,1,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Zion2", DisplayName="绝品 绝品天堂敞篷版", Hash=3101863448, Mod=new int[43]{ 3,0,0,0,4,1,0,1,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 4 当前分类: 肌肉车
    /// </summary>
    public static List<VehicleInfo> Muscle = new()
    {
        new VehicleInfo(){ Name="Blade", DisplayName="威皮 刀锋", Hash=3089165662, Mod=new int[43]{ 2,1,1,0,1,1,1,4,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Buccaneer", DisplayName="亚班尼 风流海盗", Hash=3612755468, Mod=new int[43]{ 0,1,2,0,0,0,1,4,0,0,1,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Buccaneer2", DisplayName="亚班尼 风流海盗改装版", Hash=3281516360, Mod=new int[43]{ 0,1,2,0,1,0,1,4,1,0,0,4,3,3,58,0,5,36,4,13,16,12,45,0,14,0,0,16,15,22,4,7,4,5,4,0,0,0,0,2,0,0,9 } },
        new VehicleInfo(){ Name="Buffalo4", DisplayName="冒险家 猛牛 STX", Hash=3675036420, Mod=new int[43]{ 15,8,2,4,8,1,5,4,1,1,13,4,3,3,58,4,5,50,0,0,0,0,6,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,1,0,0,12 } },
        new VehicleInfo(){ Name="Chino", DisplayName="威皮 奇诺", Hash=349605904, Mod=new int[43]{ 0,1,1,0,1,2,0,2,0,2,0,4,3,3,58,3,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Chino2", DisplayName="威皮 奇诺改装版", Hash=2933279331, Mod=new int[43]{ 0,1,1,0,1,0,0,2,0,2,0,4,3,3,58,0,5,36,4,13,16,12,45,0,14,0,0,16,15,22,0,8,5,4,3,0,0,0,0,2,0,0,9 } },
        new VehicleInfo(){ Name="Clique", DisplayName="威皮 克里克", Hash=2728360112, Mod=new int[43]{ 1,4,4,0,0,1,7,2,2,0,3,4,3,4,58,5,5,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,11 } },
        new VehicleInfo(){ Name="Coquette3", DisplayName="非凡 艳妇黑鳍", Hash=784565758, Mod=new int[43]{ 2,2,0,0,3,1,0,5,0,0,0,4,3,3,58,3,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Deviant", DisplayName="赛乐斯特 异类", Hash=1279262537, Mod=new int[43]{ 10,8,6,0,3,0,11,7,0,0,2,4,3,4,58,5,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Dominator", DisplayName="威皮 公路霸者", Hash=80636076, Mod=new int[43]{ 2,1,1,1,1,1,1,1,0,0,3,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dominator2", DisplayName="威皮 尿汤啤公路霸者", Hash=3379262425, Mod=new int[43]{ 2,1,1,1,1,1,1,1,0,0,3,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dominator3", DisplayName="威皮 公路霸者 GTX", Hash=3308022675, Mod=new int[43]{ 17,4,3,14,10,5,10,16,1,5,19,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dominator4", DisplayName="威皮 末日公路霸者", Hash=3606777648, Mod=new int[43]{ 3,1,0,1,5,3,6,3,0,5,0,4,3,4,58,5,5,36,0,0,0,0,0,0,0,0,0,0,0,7,0,0,0,0,4,3,3,1,0,2,0,0,4 } },
        new VehicleInfo(){ Name="Dominator5", DisplayName="威皮 科幻公路霸者", Hash=2919906639, Mod=new int[43]{ 0,1,0,1,5,3,3,0,0,5,0,4,3,4,58,5,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,4,3,3,1,0,2,0,0,18 } },
        new VehicleInfo(){ Name="Dominator6", DisplayName="威皮 梦魇公路霸者", Hash=3001042683, Mod=new int[43]{ 3,1,0,1,5,3,6,3,0,5,0,4,3,4,58,5,5,36,0,0,0,0,0,0,0,0,0,0,0,7,0,0,0,0,4,3,3,1,0,2,0,0,4 } },
        new VehicleInfo(){ Name="Dominator7", DisplayName="威皮 公路霸者 ASP", Hash=426742808, Mod=new int[43]{ 23,14,13,18,8,5,3,25,1,6,3,4,3,3,58,4,5,50,0,0,0,3,0,4,6,6,14,16,0,0,0,0,0,4,25,16,4,6,3,1,2,11,15 } },
        new VehicleInfo(){ Name="Dominator8", DisplayName="威皮 公路霸者 GTT", Hash=736672010, Mod=new int[43]{ 9,2,5,6,6,5,3,17,5,0,4,4,3,3,58,4,5,50,0,0,7,2,0,0,0,0,14,16,0,0,0,0,0,6,14,12,8,5,0,3,0,0,15 } },
        new VehicleInfo(){ Name="Dukes", DisplayName="英庞提 公爵", Hash=723973206, Mod=new int[43]{ 1,1,1,0,2,2,0,5,0,0,26,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dukes2", DisplayName="英庞提 死亡公爵", Hash=3968823444, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dukes3", DisplayName="英庞提 比特公爵", Hash=2134119907, Mod=new int[43]{ 7,10,3,4,9,8,4,12,4,2,26,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,13 } },
        new VehicleInfo(){ Name="Ellie", DisplayName="威皮 爱利", Hash=3027423925, Mod=new int[43]{ 0,2,0,0,7,0,0,0,0,0,4,4,3,3,58,3,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Faction", DisplayName="威拉德 宗派", Hash=2175389151, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Faction2", DisplayName="威拉德 宗派改装版", Hash=2504420315, Mod=new int[43]{ 0,0,0,0,2,0,0,1,0,0,0,4,3,3,58,0,5,36,4,13,16,5,45,0,14,0,0,16,15,22,2,3,4,4,5,0,0,0,0,0,0,0,9 } },
        new VehicleInfo(){ Name="Faction3", DisplayName="威拉德 宗派改装巨轮版", Hash=2255212070, Mod=new int[43]{ 0,0,0,0,2,0,0,1,0,0,0,4,3,3,58,0,5,36,4,13,16,5,45,0,14,0,0,16,15,22,2,7,0,4,5,0,0,0,0,0,0,0,9 } },
        new VehicleInfo(){ Name="Gauntlet", DisplayName="冒险家 铁腕", Hash=2494797253, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,3,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Gauntlet2", DisplayName="冒险家 红木烟业铁腕", Hash=349315417, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Gauntlet3", DisplayName="冒险家 铁腕经典版", Hash=722226637, Mod=new int[43]{ 8,4,3,7,5,6,5,13,1,2,8,4,3,4,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Gauntlet4", DisplayName="冒险家 铁腕地狱火", Hash=1934384720, Mod=new int[43]{ 10,6,1,2,5,6,6,10,6,9,1,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Gauntlet5", DisplayName="冒险家 铁腕经典改装版", Hash=2172320429, Mod=new int[43]{ 17,13,5,8,10,2,6,12,7,2,3,4,3,3,58,4,5,36,0,0,3,3,6,4,4,5,5,13,0,6,0,0,0,8,0,0,6,2,3,5,0,0,10 } },
        new VehicleInfo(){ Name="Greenwood", DisplayName="冒险家 格林伍德", Hash=40817712, Mod=new int[43]{ 11,4,2,2,12,1,2,0,11,1,3,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10,0,5,0,2,0,0,0,12 } },
        new VehicleInfo(){ Name="Hermes", DisplayName="亚班尼 赫耳墨斯", Hash=15219735, Mod=new int[43]{ 0,8,2,1,1,0,0,0,1,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,11 } },
        new VehicleInfo(){ Name="Hotknife", DisplayName="威皮 热情使徒", Hash=37348240, Mod=new int[43]{ 0,0,0,0,0,1,0,2,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Hustler", DisplayName="威皮 赫斯勒", Hash=600450546, Mod=new int[43]{ 0,2,2,2,4,0,6,4,0,0,1,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Impaler", DisplayName="绝致 刺刑官", Hash=2198276962, Mod=new int[43]{ 3,2,4,0,4,0,2,7,0,0,0,4,3,4,58,5,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Impaler2", DisplayName="绝致 末日刺刑官", Hash=1009171724, Mod=new int[43]{ 2,3,1,0,1,3,0,2,3,5,1,4,3,4,58,0,5,36,36,0,0,0,1,0,0,0,0,0,0,8,1,0,0,0,4,3,3,1,0,2,0,0,4 } },
        new VehicleInfo(){ Name="Impaler3", DisplayName="绝致 科幻刺刑官", Hash=2370166601, Mod=new int[43]{ 3,3,1,0,0,3,0,3,0,5,3,4,3,4,58,5,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,4,3,3,1,0,2,0,0,18 } },
        new VehicleInfo(){ Name="Impaler4", DisplayName="绝致 梦魇刺刑官", Hash=2550461639, Mod=new int[43]{ 2,3,1,0,1,3,0,2,3,5,1,4,3,4,58,0,5,36,36,0,0,0,1,0,0,0,0,0,0,8,1,0,0,0,4,3,3,1,0,2,0,0,4 } },
        new VehicleInfo(){ Name="Imperator", DisplayName="威皮 末日凯撒大帝", Hash=444994115, Mod=new int[43]{ 0,0,0,0,6,3,3,7,0,5,1,4,3,3,58,4,5,36,0,0,0,0,3,0,0,0,0,0,0,7,0,0,0,0,4,3,4,1,1,2,0,0,4 } },
        new VehicleInfo(){ Name="Imperator2", DisplayName="威皮 科幻凯撒大帝", Hash=1637620610, Mod=new int[43]{ 0,0,0,0,4,3,0,7,0,5,1,4,3,3,58,4,5,36,0,0,0,0,2,0,0,0,0,0,0,0,0,0,0,0,4,3,4,1,1,2,0,0,18 } },
        new VehicleInfo(){ Name="Imperator3", DisplayName="威皮 梦魇凯撒大帝", Hash=3539435063, Mod=new int[43]{ 0,0,0,0,6,3,3,7,0,5,1,4,3,3,58,4,5,36,0,0,0,0,3,0,0,0,0,0,0,7,0,0,0,0,4,3,4,1,1,2,0,0,4 } },
        new VehicleInfo(){ Name="Lurcher", DisplayName="亚班尼 闹鬼灵车", Hash=2068293287, Mod=new int[43]{ 0,1,1,0,3,0,1,4,0,0,0,4,3,3,58,4,5,36,0,0,0,0,45,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="Manana2", DisplayName="亚班尼 明日之星改装版", Hash=1717532765, Mod=new int[43]{ 0,3,0,0,1,0,1,0,2,0,0,4,3,3,58,0,5,30,4,13,16,14,45,0,14,0,0,16,15,22,0,5,5,4,5,0,2,0,0,2,0,0,12 } },
        new VehicleInfo(){ Name="Moonbeam", DisplayName="绝致 月光", Hash=525509695, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Moonbeam2", DisplayName="绝致 月光改装版", Hash=1896491931, Mod=new int[43]{ 1,0,0,0,1,1,2,0,0,0,2,4,3,3,58,0,5,36,6,13,16,4,45,0,14,5,1,16,15,22,0,5,4,4,3,0,0,0,0,0,0,0,9 } },
        new VehicleInfo(){ Name="Nightshade", DisplayName="英庞提 暗夜魅影", Hash=2351681756, Mod=new int[43]{ 4,1,1,0,1,1,3,4,0,0,0,4,3,3,58,3,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Peyote2", DisplayName="威皮 佩优特古董赛车", Hash=2490551588, Mod=new int[43]{ 0,0,0,0,11,5,5,17,0,0,0,4,3,3,58,4,5,36,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Phoenix", DisplayName="英庞提 不死鸟", Hash=2199527893, Mod=new int[43]{ 2,2,0,1,2,0,1,3,0,0,1,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Picador", DisplayName="雪佛 斗牛士", Hash=1507916787, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="RatLoader", DisplayName="老爷卡车", Hash=3627815886, Mod=new int[43]{ 0,0,0,0,4,1,4,6,2,0,4,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="RatLoader2", DisplayName="冒险家 老爷货车", Hash=3705788919, Mod=new int[43]{ 0,0,0,0,4,1,3,5,2,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Ruiner", DisplayName="英庞提 灭世暴徒", Hash=4067225593, Mod=new int[43]{ 4,2,0,0,4,0,0,3,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Ruiner2", DisplayName="英庞提 灭世暴徒 2000", Hash=941494461, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Ruiner3", DisplayName="英庞提 灭世暴徒", Hash=777714999, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Ruiner4", DisplayName="英庞提 灭世暴徒 ZZ-8", Hash=1706945532, Mod=new int[43]{ 21,19,11,15,11,3,3,20,6,2,5,4,3,3,58,2,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="SabreGT", DisplayName="绝致 军刀涡轮", Hash=2609945748, Mod=new int[43]{ 1,4,1,0,3,2,2,5,0,0,1,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="SabreGT2", DisplayName="绝致 军刀涡轮改装版", Hash=223258115, Mod=new int[43]{ 1,4,1,0,3,2,2,5,0,0,0,4,3,3,58,4,5,36,4,13,16,14,45,0,14,0,0,16,15,22,2,5,4,7,4,0,0,0,0,0,0,0,9 } },
        new VehicleInfo(){ Name="SlamVan", DisplayName="威皮 大满贯皮卡", Hash=729783779, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="SlamVan2", DisplayName="威皮 失落摩托帮大满贯皮卡", Hash=833469436, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="SlamVan3", DisplayName="威皮 大满贯皮卡改装版", Hash=1119641113, Mod=new int[43]{ 2,1,0,0,5,0,5,4,0,0,1,4,3,3,58,4,5,36,4,13,16,3,45,2,14,0,11,16,15,22,0,0,4,4,5,0,0,0,0,2,1,0,9 } },
        new VehicleInfo(){ Name="SlamVan4", DisplayName="威皮 末日大满贯皮卡", Hash=2233918197, Mod=new int[43]{ 0,0,3,0,0,3,4,5,0,5,0,4,3,3,58,0,5,36,0,0,0,0,0,0,0,0,0,0,0,3,1,0,0,0,4,3,6,1,1,2,0,0,4 } },
        new VehicleInfo(){ Name="SlamVan5", DisplayName="威皮 科幻大满贯皮卡", Hash=373261600, Mod=new int[43]{ 0,0,3,0,0,3,4,0,0,5,0,4,3,3,58,0,5,36,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,4,3,6,1,1,2,0,0,18 } },
        new VehicleInfo(){ Name="SlamVan6", DisplayName="威皮 梦魇大满贯皮卡", Hash=1742022738, Mod=new int[43]{ 1,0,3,0,0,3,4,5,0,5,0,4,3,3,58,0,5,36,0,0,0,0,0,0,0,0,0,0,0,3,0,0,0,0,4,3,6,1,1,2,0,0,4 } },
        new VehicleInfo(){ Name="Stalion", DisplayName="绝致 种马", Hash=1923400478, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Stalion2", DisplayName="绝致 吃得饱汉堡种马", Hash=3893323758, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tampa", DisplayName="绝致 坦帕", Hash=972671128, Mod=new int[43]{ 3,4,3,0,1,1,4,4,0,0,1,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tampa3", DisplayName="绝致 武装坦帕", Hash=3084515313, Mod=new int[43]{ 0,1,1,0,0,3,0,3,0,1,1,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="Tulip", DisplayName="绝致 郁金", Hash=1456744817, Mod=new int[43]{ 6,7,1,0,4,0,0,11,0,0,0,4,3,4,58,5,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Vamos", DisplayName="绝致 瓦魔狮", Hash=4245851645, Mod=new int[43]{ 8,6,3,0,6,2,6,10,3,0,1,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Vigero", DisplayName="绝致 活力够", Hash=3469130167, Mod=new int[43]{ 2,0,0,0,1,1,0,5,0,0,1,4,3,3,58,3,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Vigero2", DisplayName="绝致 活力够 ZX", Hash=2536587772, Mod=new int[43]{ 16,17,15,17,8,3,9,29,14,6,3,5,4,4,58,5,5,36,0,0,0,0,0,0,0,0,0,0,4,0,1,0,0,0,0,0,0,0,0,0,0,0,13 } },
        new VehicleInfo(){ Name="Virgo", DisplayName="亚班尼 室女座", Hash=3796912450, Mod=new int[43]{ 0,1,1,0,1,3,1,2,1,0,0,4,3,3,58,3,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Virgo2", DisplayName="敦追里 经典室女座改装版", Hash=3395457658, Mod=new int[43]{ 0,0,0,0,3,1,3,0,0,0,0,4,3,3,58,0,5,36,4,13,16,4,45,0,14,0,0,16,15,22,5,6,4,5,4,0,0,3,2,4,0,0,9 } },
        new VehicleInfo(){ Name="Virgo3", DisplayName="敦追里 经典室女座", Hash=16646064, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Voodoo", DisplayName="绝致 巫毒改装版", Hash=2006667053, Mod=new int[43]{ 0,2,0,0,2,1,3,0,0,0,0,4,3,3,58,0,5,30,5,13,16,12,45,0,8,0,0,16,15,22,0,5,5,4,3,0,3,3,8,3,0,0,9 } },
        new VehicleInfo(){ Name="Voodoo2", DisplayName="绝致 巫毒", Hash=523724515, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Weevil2", DisplayName="毕福 象鼻虫改装版", Hash=3300595976, Mod=new int[43]{ 8,13,7,6,14,4,11,8,8,0,16,4,3,3,58,4,5,36,0,0,0,10,0,0,0,0,8,18,15,0,0,0,0,0,0,0,10,10,0,0,8,6,16 } },
        new VehicleInfo(){ Name="Yosemite", DisplayName="绝致 约塞米蒂", Hash=1871995513, Mod=new int[43]{ 10,11,1,11,0,3,4,9,0,0,4,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Yosemite2", DisplayName="绝致 漂移约塞米蒂", Hash=1693751655, Mod=new int[43]{ 9,11,1,11,1,3,4,5,1,0,4,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
    };

    /// <summary>
    /// 5 当前分类: 经典跑车
    /// </summary>
    public static List<VehicleInfo> SportsClassics = new()
    {
        new VehicleInfo(){ Name="Ardent", DisplayName="欧斯洛 炽焰", Hash=159274291, Mod=new int[43]{ 3,5,1,0,1,0,0,6,2,0,6,4,3,4,58,3,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="BType", DisplayName="亚班尼 罗斯福", Hash=117401876, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="BType2", DisplayName="亚班尼 科学怪人", Hash=3463132580, Mod=new int[43]{ 0,0,0,0,0,0,0,2,0,0,0,4,3,3,58,4,5,36,0,0,0,0,45,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,4 } },
        new VehicleInfo(){ Name="BType3", DisplayName="亚班尼 罗斯福勇气", Hash=3692679425, Mod=new int[43]{ 2,2,2,1,0,3,2,3,2,1,1,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,3,0,2,0,0 } },
        new VehicleInfo(){ Name="Casco", DisplayName="兰帕达缇 卡斯科", Hash=941800958, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cheburek", DisplayName="卢恩 切布列克", Hash=3306466016, Mod=new int[43]{ 9,8,4,2,0,0,2,8,2,0,7,4,3,3,58,5,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Cheetah2", DisplayName="古罗帝 猎豹经典版", Hash=223240013, Mod=new int[43]{ 18,8,1,5,3,0,0,4,2,4,4,4,3,4,58,3,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Coquette2", DisplayName="非凡 艳妇经典版", Hash=1011753235, Mod=new int[43]{ 0,7,3,0,4,1,0,2,0,0,0,4,3,3,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Deluxo", DisplayName="英庞提 德罗索", Hash=1483171323, Mod=new int[43]{ 8,3,0,2,3,0,9,4,0,0,1,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dynasty", DisplayName="威尼 王朝", Hash=310284501, Mod=new int[43]{ 5,6,6,8,4,0,6,6,6,6,7,4,3,3,58,5,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Fagaloa", DisplayName="福狮 法加洛亚", Hash=1617472902, Mod=new int[43]{ 4,5,2,9,2,1,5,0,3,6,6,4,3,3,58,5,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Feltzer3", DisplayName="贝飞特 斯特林 GT", Hash=2728226064, Mod=new int[43]{ 1,0,1,0,2,2,2,1,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="GT500", DisplayName="古罗帝 GT500", Hash=2215179066, Mod=new int[43]{ 0,2,0,0,2,0,0,2,0,0,0,4,3,3,58,3,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,9 } },
        new VehicleInfo(){ Name="Infernus2", DisplayName="佩嘉西 炼狱魔经典版", Hash=2889029532, Mod=new int[43]{ 6,0,0,3,3,6,6,0,3,0,4,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="JB700", DisplayName="浪子 JB 700", Hash=1051415893, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="JB7002", DisplayName="浪子 JB 700W", Hash=394110044, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,2,1,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Mamba", DisplayName="绝致 曼巴", Hash=2634021974, Mod=new int[43]{ 0,0,0,0,1,0,0,5,0,0,0,4,3,3,58,3,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Manana", DisplayName="亚班尼 明日之星", Hash=2170765704, Mod=new int[43]{ 0,3,1,0,2,2,1,2,1,0,0,4,3,3,58,0,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Michelli", DisplayName="兰帕达缇 米其利 GT", Hash=1046206681, Mod=new int[43]{ 4,7,2,3,6,2,5,1,3,0,4,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Monroe", DisplayName="佩嘉西 门罗", Hash=3861591579, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,3,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Nebula", DisplayName="福狮 星云涡轮", Hash=3412338231, Mod=new int[43]{ 7,8,1,1,3,1,3,7,1,2,5,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Peyote", DisplayName="威皮 佩优特", Hash=1830407356, Mod=new int[43]{ 0,1,3,0,1,2,4,3,1,0,0,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Peyote3", DisplayName="威皮 佩优特改装版", Hash=1107404867, Mod=new int[43]{ 0,0,0,0,5,2,4,6,0,1,0,4,3,3,58,0,5,30,4,13,16,14,45,0,8,0,0,16,15,22,4,5,5,6,0,0,0,3,0,2,0,0,10 } },
        new VehicleInfo(){ Name="Pigalle", DisplayName="兰帕达缇 皮卡乐", Hash=1078682497, Mod=new int[43]{ 1,0,0,0,2,0,0,3,0,0,4,4,3,3,58,4,5,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="RapidGT3", DisplayName="浪子 疾速 GT 经典版", Hash=2049897956, Mod=new int[43]{ 5,4,3,2,16,1,3,0,5,5,4,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Retinue", DisplayName="威皮 随行者", Hash=1841130506, Mod=new int[43]{ 5,4,1,1,4,1,3,2,1,0,1,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8 } },
        new VehicleInfo(){ Name="Retinue2", DisplayName="威皮 随行者 Mk 2", Hash=2031587082, Mod=new int[43]{ 6,6,1,0,0,5,4,8,6,2,5,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Savestra", DisplayName="爱尼仕 萨维斯特拉", Hash=903794909, Mod=new int[43]{ 9,12,6,4,5,8,12,6,7,0,1,4,3,3,58,3,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Stinger", DisplayName="古罗帝 史汀格", Hash=1545842587, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="StingerGT", DisplayName="古罗帝 史汀格 GT", Hash=2196019706, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Stromberg", DisplayName="欧斯洛 斯特龙伯格", Hash=886810209, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Swinger", DisplayName="欧斯洛 放荡者", Hash=500482303, Mod=new int[43]{ 0,2,0,4,4,10,4,11,0,0,3,4,3,3,58,3,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Toreador", DisplayName="佩嘉西 图拉尔多", Hash=1455990255, Mod=new int[43]{ 10,9,9,0,0,0,10,0,0,0,2,4,3,3,58,2,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Torero", DisplayName="佩嘉西 斗牛", Hash=1504306544, Mod=new int[43]{ 6,2,3,0,3,0,5,4,0,4,5,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tornado", DisplayName="绝致 龙卷风", Hash=464687292, Mod=new int[43]{ 0,2,0,0,2,0,0,3,4,1,0,4,3,3,58,0,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tornado2", DisplayName="绝致 龙卷风", Hash=1531094468, Mod=new int[43]{ 0,2,0,0,2,0,0,3,4,1,0,4,3,3,58,0,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tornado3", DisplayName="绝致 龙卷风", Hash=1762279763, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tornado4", DisplayName="绝致 龙卷风", Hash=2261744861, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tornado5", DisplayName="绝致 龙卷风改装版", Hash=2497353967, Mod=new int[43]{ 0,2,3,0,4,0,0,5,0,1,0,4,3,3,58,0,5,30,5,13,16,14,45,8,14,0,0,16,15,22,0,3,6,5,4,0,6,3,8,3,0,0,9 } },
        new VehicleInfo(){ Name="Tornado6", DisplayName="绝致 龙卷风破烂老爷车", Hash=2736567667, Mod=new int[43]{ 0,0,0,0,1,0,0,2,0,0,0,4,3,3,58,0,5,30,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Turismo2", DisplayName="古罗帝 远途经典版", Hash=3312836369, Mod=new int[43]{ 11,6,0,2,4,0,0,7,2,0,3,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Viseris", DisplayName="兰帕达缇 维瑟瑞斯", Hash=3903371924, Mod=new int[43]{ 10,5,2,4,7,3,7,3,2,0,1,4,3,3,58,3,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Zion3", DisplayName="绝品 天堂经典版", Hash=1862507111, Mod=new int[43]{ 8,7,3,10,5,3,2,8,3,2,5,4,3,4,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="ZType", DisplayName="特卢菲 Z 型", Hash=758895617, Mod=new int[43]{ 0,1,0,1,0,0,2,1,0,0,0,4,3,3,58,0,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Z190", DisplayName="卡林 190z", Hash=838982985, Mod=new int[43]{ 21,16,14,18,14,12,11,17,9,9,12,4,3,3,58,3,5,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
    };

    /// <summary>
    /// 6 当前分类: 跑车
    /// </summary>
    public static List<VehicleInfo> Sports = new()
    {
        new VehicleInfo(){ Name="Alpha", DisplayName="亚班尼 阿尔法", Hash=767087018, Mod=new int[43]{ 4,1,0,1,2,0,0,2,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Banshee", DisplayName="冒险家 女妖", Hash=3253274834, Mod=new int[43]{ 3,1,0,0,2,0,0,2,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15 } },
        new VehicleInfo(){ Name="BestiaGTS", DisplayName="古罗帝 野兽 GTS", Hash=1274868363, Mod=new int[43]{ 2,3,0,3,1,0,0,3,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Blista2", DisplayName="丁卡 小型旅行家", Hash=1039032026, Mod=new int[43]{ 3,0,0,1,3,1,0,2,0,0,1,4,3,3,58,4,5,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Blista3", DisplayName="丁卡 冲冲猴旅行家", Hash=3703315515, Mod=new int[43]{ 3,0,0,1,3,1,0,2,0,0,1,4,3,3,58,4,5,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Buffalo", DisplayName="冒险家 猛牛", Hash=3990165190, Mod=new int[43]{ 1,1,1,1,1,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Buffalo2", DisplayName="冒险家 猛牛 S", Hash=736902334, Mod=new int[43]{ 5,5,2,2,5,1,4,4,0,0,2,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Buffalo3", DisplayName="冒险家 霜碧猛牛", Hash=237764926, Mod=new int[43]{ 5,5,2,2,5,1,4,4,0,0,2,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Calico", DisplayName="卡林 卡利科 GTF", Hash=3101054893, Mod=new int[43]{ 22,27,7,24,10,7,2,26,3,0,20,4,3,3,58,4,5,40,0,3,0,0,0,4,0,7,15,17,0,0,0,0,0,4,8,11,3,6,2,5,0,2,15 } },
        new VehicleInfo(){ Name="Carbonizzare", DisplayName="古罗帝 汗血宝马", Hash=2072687711, Mod=new int[43]{ 2,0,0,0,1,0,0,1,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Comet2", DisplayName="菲斯特 陆上彗星", Hash=3249425686, Mod=new int[43]{ 2,2,0,0,1,1,0,0,0,0,1,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Comet3", DisplayName="菲斯特 陆上彗星怀旧改装版", Hash=2272483501, Mod=new int[43]{ 8,19,4,9,4,5,0,9,8,0,0,4,3,3,58,4,5,50,0,0,0,2,0,5,8,6,14,16,0,0,0,0,0,0,0,12,0,3,0,0,0,0,9 } },
        new VehicleInfo(){ Name="Comet4", DisplayName="菲斯特 彗星狩猎者", Hash=1561920505, Mod=new int[43]{ 3,18,2,6,15,5,3,10,3,6,1,4,3,3,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30 } },
        new VehicleInfo(){ Name="Comet5", DisplayName="菲斯特 陆上彗星 SR", Hash=661493923, Mod=new int[43]{ 8,3,2,3,4,2,0,2,1,0,2,4,3,3,58,3,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Comet6", DisplayName="菲斯特 陆上彗星 S2", Hash=2568944644, Mod=new int[43]{ 24,8,10,10,5,7,0,14,4,3,2,4,3,3,58,4,5,50,0,3,5,2,0,7,0,4,14,16,0,0,0,0,0,0,0,0,9,7,6,0,3,0,15 } },
        new VehicleInfo(){ Name="Comet7", DisplayName="菲斯特 陆上彗星 S2 敞篷版", Hash=1141395928, Mod=new int[43]{ 5,8,10,10,5,0,0,14,4,0,0,4,3,3,58,4,5,50,0,0,5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,11 } },
        new VehicleInfo(){ Name="Coquette", DisplayName="非凡 艳妇", Hash=108773431, Mod=new int[43]{ 5,4,4,2,4,1,0,5,1,0,1,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Coquette4", DisplayName="非凡 艳妇 D10", Hash=2566281822, Mod=new int[43]{ 8,5,4,3,6,3,3,6,0,0,3,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Corsita", DisplayName="兰帕达缇 科西塔", Hash=3540279623, Mod=new int[43]{ 15,11,10,12,5,3,8,14,9,4,18,4,3,3,58,2,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,11 } },
        new VehicleInfo(){ Name="Cypher", DisplayName="绝品 塞弗", Hash=1755697647, Mod=new int[43]{ 14,12,5,9,8,9,13,14,2,5,8,4,3,3,58,4,5,40,0,0,2,9,2,4,1,8,11,16,0,0,0,0,0,12,0,17,9,8,7,4,0,0,15 } },
        new VehicleInfo(){ Name="Drafter", DisplayName="奥北 8F 尾随者", Hash=686471183, Mod=new int[43]{ 8,3,3,3,6,3,4,9,1,3,6,4,3,4,58,5,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Elegy", DisplayName="爱尼仕 挽歌怀旧改装版", Hash=196747873, Mod=new int[43]{ 20,6,3,5,9,5,3,12,6,0,7,4,3,3,58,4,5,50,0,3,4,1,0,5,15,7,14,16,0,0,0,0,0,4,8,12,6,11,2,5,2,0,9 } },
        new VehicleInfo(){ Name="Elegy2", DisplayName="爱尼仕 挽歌 RH8", Hash=3728579874, Mod=new int[43]{ 5,2,3,4,2,1,2,3,0,0,1,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Euros", DisplayName="爱尼仕 欧洲", Hash=2038480341, Mod=new int[43]{ 16,3,3,12,6,8,0,21,9,0,11,4,3,3,58,4,5,40,0,0,8,2,0,3,0,8,15,16,0,0,0,0,0,4,10,20,8,6,15,0,0,2,15 } },
        new VehicleInfo(){ Name="Feltzer2", DisplayName="贝飞特 飞特者", Hash=2299640309, Mod=new int[43]{ 2,1,1,0,0,0,0,0,1,0,1,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="FlashGT", DisplayName="威皮 闪电 GT", Hash=3035832600, Mod=new int[43]{ 8,6,0,6,4,6,0,5,0,0,3,4,3,3,58,5,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Furoregt", DisplayName="兰帕达缇 沸洛雷 GT", Hash=3205927392, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Fusilade", DisplayName="赛乐斯特 眩光", Hash=499169875, Mod=new int[43]{ 3,1,0,1,3,0,0,2,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Futo", DisplayName="卡林 福多", Hash=2016857647, Mod=new int[43]{ 4,3,3,1,3,1,2,2,0,0,1,4,3,3,58,4,5,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Futo2", DisplayName="卡林 福多 GTX", Hash=2787736776, Mod=new int[43]{ 16,7,2,3,13,5,6,15,3,2,5,4,3,3,58,4,5,48,0,4,2,2,0,5,0,0,14,16,0,0,0,0,0,4,8,12,6,0,3,3,3,7,15 } },
        new VehicleInfo(){ Name="GB200", DisplayName="威皮 GB200", Hash=1909189272, Mod=new int[43]{ 3,4,3,1,1,5,3,10,1,0,1,4,3,3,58,5,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Growler", DisplayName="菲斯特 嚎叫者", Hash=1304459735, Mod=new int[43]{ 7,3,5,8,18,12,6,16,2,2,5,4,3,3,58,4,5,50,0,9,14,9,0,3,3,4,14,16,0,0,0,0,0,0,0,15,0,9,0,0,5,4,15 } },
        new VehicleInfo(){ Name="HotringSabre", DisplayName="绝致 燃轨军刀", Hash=1115909093, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31 } },
        new VehicleInfo(){ Name="Imorgon", DisplayName="傲弗拉 明日", Hash=3162245632, Mod=new int[43]{ 14,8,20,2,5,24,2,7,18,2,2,4,3,3,58,3,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Issi7", DisplayName="威尼 天威跑车版", Hash=1854776567, Mod=new int[43]{ 5,6,3,6,7,0,3,10,4,2,7,4,3,4,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="ItaliGTO", DisplayName="古罗帝 义塔力 GTO", Hash=3963499524, Mod=new int[43]{ 8,9,4,6,5,1,3,10,3,0,8,4,3,4,58,5,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,11 } },
        new VehicleInfo(){ Name="ItaliRSX", DisplayName="古罗帝 义塔力 RSX", Hash=3145241962, Mod=new int[43]{ 20,5,14,9,8,5,7,13,0,2,7,4,3,3,58,2,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,11 } },
        new VehicleInfo(){ Name="Jester", DisplayName="丁卡 弄臣", Hash=2997294755, Mod=new int[43]{ 4,3,2,3,3,2,0,0,0,0,1,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Jester2", DisplayName="丁卡 弄臣（赛车）", Hash=3188613414, Mod=new int[43]{ 4,3,2,3,3,2,0,0,0,0,1,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Jester3", DisplayName="丁卡 弄臣经典版", Hash=4080061290, Mod=new int[43]{ 10,12,4,2,4,4,5,10,2,0,3,4,3,3,58,5,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Jester4", DisplayName="丁卡 弄臣 RR", Hash=2712905841, Mod=new int[43]{ 14,12,11,9,13,9,8,13,2,5,5,4,3,3,58,4,5,36,0,0,3,11,2,4,4,8,11,16,0,0,0,0,0,5,9,17,3,0,2,8,0,0,15 } },
        new VehicleInfo(){ Name="Jugular", DisplayName="欧斯洛 扼喉", Hash=4086055493, Mod=new int[43]{ 10,3,2,4,2,0,3,7,2,0,1,4,3,4,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Khamelion", DisplayName="海岬 变色龙", Hash=544021352, Mod=new int[43]{ 2,0,0,0,2,0,0,2,0,0,2,4,3,0,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Komoda", DisplayName="兰帕达缇 科莫达", Hash=3460613305, Mod=new int[43]{ 24,12,4,18,4,0,0,17,3,2,11,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Kuruma", DisplayName="卡林 骷髅马", Hash=2922118804, Mod=new int[43]{ 5,3,0,6,3,1,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15 } },
        new VehicleInfo(){ Name="Kuruma2", DisplayName="卡林 骷髅马（装甲版）", Hash=410882957, Mod=new int[43]{ 5,3,0,6,3,1,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,15 } },
        new VehicleInfo(){ Name="Locust", DisplayName="欧斯洛 蝗虫", Hash=3353694737, Mod=new int[43]{ 9,8,0,6,6,12,0,5,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Lynx", DisplayName="欧斯洛 山猫", Hash=482197771, Mod=new int[43]{ 4,4,5,1,4,1,0,4,0,0,0,4,3,3,58,5,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="Massacro", DisplayName="浪子 马萨克罗", Hash=4152024626, Mod=new int[43]{ 4,3,2,4,1,2,0,3,1,0,0,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Massacro2", DisplayName="浪子 马萨克罗（赛车）", Hash=3663206819, Mod=new int[43]{ 4,3,2,4,1,2,0,3,1,0,0,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Neo", DisplayName="维沙 尼欧", Hash=2674840994, Mod=new int[43]{ 9,8,3,4,13,8,12,10,2,0,6,4,3,4,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Neon", DisplayName="菲斯特 霓虹", Hash=2445973230, Mod=new int[43]{ 6,6,2,9,0,0,0,2,5,0,0,4,3,0,58,3,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Ninef", DisplayName="奥北 9F", Hash=1032823388, Mod=new int[43]{ 1,1,1,1,1,0,0,1,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Ninef2", DisplayName="奥北 9F 敞篷版", Hash=2833484545, Mod=new int[43]{ 1,1,1,1,3,1,0,1,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Omnis", DisplayName="奥北 奥姆尼斯", Hash=3517794615, Mod=new int[43]{ 2,0,0,0,1,0,0,0,0,0,0,4,3,3,58,3,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="OmniseGT", DisplayName="奥北 奥姆尼斯 e-GT", Hash=3789743831, Mod=new int[43]{ 8,6,6,3,0,1,3,2,2,1,9,4,3,0,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,0,0,0,15 } },
        new VehicleInfo(){ Name="Paragon", DisplayName="埃努斯 帕拉贡 R", Hash=3847255899, Mod=new int[43]{ 4,8,3,3,5,6,5,10,2,0,2,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Paragon2", DisplayName="埃努斯 帕拉贡 R（装甲版）", Hash=1416466158, Mod=new int[43]{ 4,8,3,3,5,6,5,10,2,0,2,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Pariah", DisplayName="欧斯洛 放逐者", Hash=867799010, Mod=new int[43]{ 12,8,2,2,0,0,0,11,0,0,2,4,3,3,58,3,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,9 } },
        new VehicleInfo(){ Name="Penumbra", DisplayName="麦霸子 半影使者", Hash=3917501776, Mod=new int[43]{ 4,2,3,2,2,1,1,3,0,0,1,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Penumbra2", DisplayName="麦霸子 半影使者 FF", Hash=3663644634, Mod=new int[43]{ 22,10,8,15,9,12,16,13,4,2,6,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Raiden", DisplayName="旋风 雷电", Hash=2765724541, Mod=new int[43]{ 6,3,2,3,0,0,0,2,2,0,0,4,3,0,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="RapidGT", DisplayName="浪子 疾速 GT", Hash=2360515092, Mod=new int[43]{ 2,0,0,0,1,1,0,1,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="RapidGT2", DisplayName="浪子 疾速 GT", Hash=1737773231, Mod=new int[43]{ 2,0,0,0,1,0,0,1,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Raptor", DisplayName="毕福 迅猛龙", Hash=3620039993, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Remus", DisplayName="爱尼仕 雷姆斯", Hash=1377217886, Mod=new int[43]{ 17,6,6,4,13,5,6,11,7,3,4,4,3,3,58,4,5,50,0,0,7,3,0,5,15,7,14,16,0,0,0,2,0,6,10,12,5,0,5,5,0,1,15 } },
        new VehicleInfo(){ Name="Revolter", DisplayName="绝品 反叛者", Hash=3884762073, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,1,4,3,3,58,0,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="RT3000", DisplayName="丁卡 RT3000", Hash=3842363289, Mod=new int[43]{ 8,5,14,0,9,0,6,10,9,3,8,4,3,3,58,4,5,50,0,0,5,3,0,4,0,7,14,16,0,0,0,0,0,6,10,12,5,0,0,0,2,8,15 } },
        new VehicleInfo(){ Name="Ruston", DisplayName="海岬 拉斯顿", Hash=719660200, Mod=new int[43]{ 5,4,4,5,4,4,4,4,0,0,0,4,3,3,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Schafter3", DisplayName="贝飞特 莎夫特 V12", Hash=2809443750, Mod=new int[43]{ 3,3,1,2,4,0,0,3,0,0,1,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Schafter4", DisplayName="贝飞特 长轴莎夫特", Hash=1489967196, Mod=new int[43]{ 3,3,1,2,4,0,0,3,0,0,1,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Schlagen", DisplayName="贝飞特 撞击 GT", Hash=3787471536, Mod=new int[43]{ 10,9,6,6,4,4,5,10,3,2,5,4,3,4,58,5,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Schwarzer", DisplayName="贝飞特 施瓦兹", Hash=3548084598, Mod=new int[43]{ 3,3,1,2,4,1,1,1,0,0,1,4,3,3,58,3,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Sentinel3", DisplayName="绝品 卫士经典版", Hash=1104234922, Mod=new int[43]{ 18,9,3,3,4,5,4,16,3,0,13,4,3,3,58,3,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,9 } },
        new VehicleInfo(){ Name="Sentinel4", DisplayName="绝品 卫士经典宽体版", Hash=2938086457, Mod=new int[43]{ 19,15,17,12,11,5,11,19,2,0,8,4,3,3,58,2,5,36,0,0,0,3,0,5,0,8,15,16,0,0,0,0,0,6,10,12,7,6,16,3,7,2,14 } },
        new VehicleInfo(){ Name="Seven70", DisplayName="浪子 柒-70", Hash=2537130571, Mod=new int[43]{ 4,0,0,2,2,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="SM722", DisplayName="贝飞特 SM722", Hash=775514032, Mod=new int[43]{ 21,6,7,12,5,4,9,5,0,0,0,4,3,3,58,2,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Specter", DisplayName="浪子 幽鬼", Hash=1886268224, Mod=new int[43]{ 1,1,1,1,1,0,0,0,0,0,0,4,3,3,58,3,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Specter2", DisplayName="浪子 幽鬼改装版", Hash=1074745671, Mod=new int[43]{ 17,13,9,12,4,4,0,0,7,0,0,4,3,3,58,4,5,40,0,0,0,0,0,4,8,1,11,16,0,0,0,0,0,0,0,0,0,0,0,0,0,0,9 } },
        new VehicleInfo(){ Name="Streiter", DisplayName="贝飞特 斯垂特", Hash=1741861769, Mod=new int[43]{ 0,6,0,0,0,0,0,9,0,0,0,4,3,3,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Sugoi", DisplayName="丁卡 斯国一", Hash=987469656, Mod=new int[43]{ 14,14,7,9,7,0,7,12,4,0,6,4,3,3,58,5,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Sultan", DisplayName="卡林 王者", Hash=970598228, Mod=new int[43]{ 3,2,1,1,1,1,0,4,0,0,1,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Sultan2", DisplayName="卡林 王者经典版", Hash=872704284, Mod=new int[43]{ 16,5,4,4,9,9,4,15,3,7,3,4,3,3,58,4,5,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Sultan3", DisplayName="卡林 王者 RS 经典版", Hash=4003946083, Mod=new int[43]{ 16,5,4,4,8,5,4,15,3,7,3,4,3,3,58,4,5,48,0,0,0,2,0,5,15,7,0,0,0,0,0,0,0,3,7,12,5,7,7,0,0,0,15 } },
        new VehicleInfo(){ Name="Surano", DisplayName="贝飞特 速雷", Hash=384071873, Mod=new int[43]{ 2,1,1,1,1,0,0,2,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tampa2", DisplayName="绝致 漂移坦帕", Hash=3223586949, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,5,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="TenF", DisplayName="奥北 10F", Hash=3400983137, Mod=new int[43]{ 24,18,18,16,12,6,17,19,3,4,10,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="TenF2", DisplayName="奥北 10F 宽体版", Hash=274946574, Mod=new int[43]{ 29,18,20,16,22,0,2,19,7,8,10,4,3,3,58,5,5,40,0,0,17,7,0,4,0,4,14,7,0,0,0,0,0,0,0,0,1,4,7,0,0,0,16 } },
        new VehicleInfo(){ Name="Tropos", DisplayName="兰帕达缇 逐波雷厉", Hash=1887331236, Mod=new int[43]{ 2,0,0,0,2,0,1,1,0,0,1,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="Vectre", DisplayName="皇霸天 韦柯特", Hash=2754593701, Mod=new int[43]{ 18,9,9,16,5,8,0,20,4,0,8,4,3,3,58,4,5,40,0,0,13,2,0,3,0,8,15,16,0,0,0,0,0,4,10,20,7,8,14,0,0,2,15 } },
        new VehicleInfo(){ Name="Verlierer2", DisplayName="冒险家 迷失者", Hash=1102544804, Mod=new int[43]{ 5,6,0,1,2,3,0,5,1,0,3,4,3,3,58,3,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Veto", DisplayName="丁卡 微托经典版", Hash=3437611258, Mod=new int[43]{ 2,6,0,0,12,3,12,0,0,4,0,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Veto2", DisplayName="丁卡 微托现代版", Hash=2802050217, Mod=new int[43]{ 2,0,0,0,12,3,12,0,0,4,0,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30 } },
        new VehicleInfo(){ Name="VStr", DisplayName="亚班尼 V-STR", Hash=1456336509, Mod=new int[43]{ 8,6,0,4,17,3,1,13,2,5,2,4,3,3,58,3,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="ZR350", DisplayName="爱尼仕 ZR350", Hash=2436313176, Mod=new int[43]{ 16,6,2,14,9,5,5,14,4,4,4,4,3,3,58,4,5,50,0,0,8,8,0,4,4,8,14,16,0,0,0,0,0,2,8,12,2,8,2,0,5,3,15 } },
        new VehicleInfo(){ Name="ZR380", DisplayName="爱尼仕 末日 ZR380", Hash=540101442, Mod=new int[43]{ 6,1,1,0,2,3,0,5,3,5,0,4,3,4,58,0,5,36,0,0,0,0,3,0,0,0,0,0,0,0,0,0,0,0,4,3,4,1,1,2,0,0,4 } },
        new VehicleInfo(){ Name="ZR3802", DisplayName="爱尼仕 科幻 ZR380", Hash=3188846534, Mod=new int[43]{ 7,2,1,0,3,3,3,3,4,5,1,4,3,4,58,0,5,36,0,0,0,0,3,0,0,0,0,0,0,0,0,0,0,0,4,3,4,1,1,2,0,0,18 } },
        new VehicleInfo(){ Name="ZR3803", DisplayName="爱尼仕 梦魇 ZR380", Hash=2816263004, Mod=new int[43]{ 6,1,1,0,2,3,0,4,3,5,0,4,3,4,58,0,5,36,0,0,0,0,3,0,0,0,0,0,0,0,0,0,0,0,4,3,4,1,1,2,0,0,4 } },
    };

    /// <summary>
    /// 7 当前分类: 超级跑车
    /// </summary>
    public static List<VehicleInfo> Super = new()
    {
        new VehicleInfo(){ Name="Adder", DisplayName="特卢菲 灵蛇", Hash=3078201489, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Autarch", DisplayName="傲弗拉 独裁者", Hash=3981782132, Mod=new int[43]{ 16,11,2,4,7,0,0,8,1,5,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Banshee2", DisplayName="冒险家 女妖 900R", Hash=633712403, Mod=new int[43]{ 6,6,0,5,5,0,4,9,2,0,0,4,3,3,58,3,5,50,0,0,0,0,45,3,0,4,13,16,0,0,0,0,0,4,0,11,0,0,0,0,0,0,8 } },
        new VehicleInfo(){ Name="Bullet", DisplayName="威皮 子弹", Hash=2598821281, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Champion", DisplayName="浪子 冠军", Hash=3379732821, Mod=new int[43]{ 4,2,3,1,2,1,2,1,0,1,3,5,4,4,58,3,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,1,0,0,10 } },
        new VehicleInfo(){ Name="Cheetah", DisplayName="古罗帝 猎豹", Hash=2983812512, Mod=new int[43]{ 3,0,0,0,3,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cyclone", DisplayName="旋风 飓风", Hash=1392481335, Mod=new int[43]{ 9,4,0,4,0,0,0,0,0,0,0,4,3,0,58,3,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8 } },
        new VehicleInfo(){ Name="Deveste", DisplayName="普林西比 蹂躏者 8", Hash=1591739866, Mod=new int[43]{ 9,4,5,0,8,5,0,0,0,0,0,4,3,3,58,1,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Emerus", DisplayName="培罗 艾梅鲁斯", Hash=1323778901, Mod=new int[43]{ 24,0,0,12,5,0,6,0,2,0,7,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="EntityXF", DisplayName="傲弗拉 本质 XF", Hash=3003014393, Mod=new int[43]{ 1,1,1,1,2,1,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="EntityXXR", DisplayName="傲弗拉 本质 XXR", Hash=2174267100, Mod=new int[43]{ 5,7,3,0,3,0,0,3,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="FMJ", DisplayName="威皮 FMJ", Hash=1426219628, Mod=new int[43]{ 5,3,0,0,0,0,0,0,0,0,4,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Furia", DisplayName="古罗帝 狂热", Hash=960812448, Mod=new int[43]{ 0,8,8,6,14,2,9,14,0,2,2,4,3,3,58,2,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="GP1", DisplayName="培罗 GP1", Hash=1234311532, Mod=new int[43]{ 11,9,2,3,18,10,3,12,3,5,7,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Ignus", DisplayName="佩嘉西 伊格纳斯", Hash=2850852987, Mod=new int[43]{ 15,17,6,12,5,0,0,18,0,0,10,4,3,3,58,2,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Infernus", DisplayName="佩嘉西 炼狱魔", Hash=418536135, Mod=new int[43]{ 2,0,0,0,1,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="ItaliGTB", DisplayName="培罗 义塔力 GTB", Hash=2246633323, Mod=new int[43]{ 10,7,8,6,7,0,0,9,1,0,5,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="ItaliGTB2", DisplayName="培罗 义塔力 GTB 改装版", Hash=3812247419, Mod=new int[43]{ 13,17,3,2,4,3,0,13,3,3,4,4,3,3,58,0,5,40,0,0,0,0,0,5,8,6,13,16,0,0,0,0,0,0,0,0,0,3,0,0,0,0,9 } },
        new VehicleInfo(){ Name="Krieger", DisplayName="贝飞特 武夫", Hash=3630826055, Mod=new int[43]{ 13,0,0,1,5,0,0,4,0,0,0,4,3,4,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="LE7B", DisplayName="爱尼仕 RE-7B", Hash=3062131285, Mod=new int[43]{ 1,0,0,0,1,0,0,0,0,0,0,4,3,3,58,3,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="LM87", DisplayName="贝飞特 LM87", Hash=4284049613, Mod=new int[43]{ 26,11,3,4,10,0,2,7,4,3,0,4,3,3,58,2,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Nero", DisplayName="特卢菲 尼罗", Hash=1034187331, Mod=new int[43]{ 0,2,0,2,5,0,0,3,0,0,0,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Nero2", DisplayName="特卢菲 尼罗改装版", Hash=1093792632, Mod=new int[43]{ 7,3,2,0,5,3,3,1,1,0,1,4,3,3,58,0,5,40,0,0,3,0,0,2,0,2,3,16,0,0,0,0,0,2,0,0,0,3,1,0,3,0,9 } },
        new VehicleInfo(){ Name="Osiris", DisplayName="佩嘉西 奥西里斯", Hash=1987142870, Mod=new int[43]{ 2,6,1,3,3,0,0,0,1,0,0,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Penetrator", DisplayName="欧斯洛 穿刺者", Hash=2536829930, Mod=new int[43]{ 5,5,6,10,5,0,6,6,0,0,3,4,3,3,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Pfister811", DisplayName="菲斯特 811", Hash=2465164804, Mod=new int[43]{ 1,5,1,2,3,0,0,0,0,0,1,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Prototipo", DisplayName="古罗帝 X80 原型", Hash=2123327359, Mod=new int[43]{ 3,3,0,3,1,0,0,0,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="RE7B", DisplayName="爱尼仕 RE-7B", Hash=3062131285, Mod=new int[43]{ 1,0,0,0,1,0,0,0,0,0,0,4,3,3,58,3,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="Reaper", DisplayName="佩嘉西 死神", Hash=234062309, Mod=new int[43]{ 3,0,0,0,0,0,0,0,0,0,0,4,3,3,58,3,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="S80", DisplayName="爱尼仕 S80RR", Hash=3970348707, Mod=new int[43]{ 7,0,0,0,4,0,0,3,1,0,1,4,3,4,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="SC1", DisplayName="绝品 SC1", Hash=1352136073, Mod=new int[43]{ 6,3,3,1,3,0,0,2,0,0,5,4,3,3,58,3,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Scramjet", DisplayName="绝致 超燃", Hash=3656405053, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,4,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Sheava", DisplayName="皇霸天 ETR1", Hash=819197656, Mod=new int[43]{ 4,2,1,0,1,0,0,1,0,0,3,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="SultanRS", DisplayName="卡林 王者 RS", Hash=3999278268, Mod=new int[43]{ 16,15,8,4,5,5,4,10,6,0,5,5,3,4,58,4,5,50,0,0,0,1,45,5,6,7,14,16,0,0,0,0,0,4,8,12,6,2,2,0,3,0,8 } },
        new VehicleInfo(){ Name="T20", DisplayName="培罗 T20", Hash=1663218586, Mod=new int[43]{ 0,2,2,1,3,0,0,2,0,0,1,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Taipan", DisplayName="雪佛 泰斑", Hash=3160260734, Mod=new int[43]{ 5,4,3,5,6,1,0,6,2,0,6,4,3,3,58,3,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tempesta", DisplayName="佩嘉西 风暴", Hash=272929391, Mod=new int[43]{ 5,2,0,3,1,1,0,9,0,0,1,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tezeract", DisplayName="佩嘉西 泰泽拉克", Hash=1031562256, Mod=new int[43]{ 6,9,4,0,0,4,0,0,0,0,0,4,3,0,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,9 } },
        new VehicleInfo(){ Name="Thrax", DisplayName="特卢菲 特拉克斯", Hash=1044193113, Mod=new int[43]{ 9,4,3,5,10,3,8,15,0,0,3,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Tigon", DisplayName="兰帕达缇 虎狮兽", Hash=2936769864, Mod=new int[43]{ 11,6,5,5,5,0,0,0,0,0,2,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Torero2", DisplayName="佩嘉西 斗牛 XO", Hash=4129572538, Mod=new int[43]{ 19,15,12,17,14,9,11,16,3,0,15,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,11 } },
        new VehicleInfo(){ Name="Turismor", DisplayName="古罗帝 远途 R", Hash=408192225, Mod=new int[43]{ 21,12,1,12,8,3,0,0,0,0,2,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Tyrant", DisplayName="傲弗拉 统治者", Hash=3918533058, Mod=new int[43]{ 3,0,0,2,2,0,0,1,0,0,0,4,3,3,58,3,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tyrus", DisplayName="培罗 泰勒斯", Hash=2067820283, Mod=new int[43]{ 2,0,0,0,3,0,0,0,0,0,0,4,3,3,58,3,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="Vacca", DisplayName="佩嘉西 狂牛", Hash=338562499, Mod=new int[43]{ 2,0,0,0,1,1,0,1,0,0,0,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Vagner", DisplayName="浪子 瓦格纳", Hash=1939284556, Mod=new int[43]{ 9,3,0,0,2,0,0,3,0,0,5,4,3,3,58,5,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Vigilante", DisplayName="义警", Hash=3052358707, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,1,4,3,3,58,5,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Visione", DisplayName="古罗帝 幻象", Hash=3296789504, Mod=new int[43]{ 5,5,5,0,4,0,0,3,0,0,0,4,3,3,58,5,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8 } },
        new VehicleInfo(){ Name="Voltic", DisplayName="旋风 狂雷", Hash=2672523198, Mod=new int[43]{ 2,1,0,1,0,0,0,3,0,0,0,4,3,0,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Voltic2", DisplayName="旋风 火箭狂雷", Hash=989294410, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,0,0,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="XA21", DisplayName="欧斯洛 XA-21", Hash=917809321, Mod=new int[43]{ 9,6,6,7,14,3,14,13,10,0,3,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Zeno", DisplayName="傲弗拉 捷诺", Hash=655665811, Mod=new int[43]{ 16,15,15,21,20,0,0,13,3,0,9,4,3,3,58,4,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Zentorno", DisplayName="佩嘉西 桑托劳", Hash=2891838741, Mod=new int[43]{ 7,0,0,3,4,2,0,2,0,0,0,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Zorrusso", DisplayName="佩嘉西 佐路索", Hash=3612858749, Mod=new int[43]{ 5,4,0,0,6,0,2,3,0,0,1,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
    };

    /// <summary>
    /// 8 当前分类: 摩托车
    /// </summary>
    public static List<VehicleInfo> Motorcycles = new()
    {
        new VehicleInfo(){ Name="Akuma", DisplayName="丁卡 街头恶魔", Hash=1672195559, Mod=new int[43]{ 0,0,0,0,2,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Avarus", DisplayName="LCC 阿瓦鲁斯", Hash=2179174271, Mod=new int[43]{ 12,2,2,8,3,3,1,0,1,0,5,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,18 } },
        new VehicleInfo(){ Name="Bagger", DisplayName="西部 驮兽", Hash=2154536131, Mod=new int[43]{ 0,1,0,0,3,2,0,0,2,0,2,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Bati", DisplayName="佩嘉西 801 巴提", Hash=4180675781, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Bati2", DisplayName="佩嘉西 801RR 巴提", Hash=3403504941, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="BF400", DisplayName="长崎 BF400", Hash=86520421, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="CarbonRS", DisplayName="长崎 碳纤 RS 型", Hash=11251904, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Chimera", DisplayName="长崎 奇美拉", Hash=6774487, Mod=new int[43]{ 6,4,0,8,6,3,0,1,8,0,7,4,3,3,58,0,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,18 } },
        new VehicleInfo(){ Name="Cliffhanger", DisplayName="西部 高潮", Hash=390201602, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="Daemon", DisplayName="西部 恶魔", Hash=2006142190, Mod=new int[43]{ 1,2,0,1,1,2,0,0,0,0,1,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Daemon2", DisplayName="西部 恶魔", Hash=2890830793, Mod=new int[43]{ 11,4,3,9,7,3,2,5,8,2,7,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,18 } },
        new VehicleInfo(){ Name="DeathBike", DisplayName="西部 末日丧尸", Hash=4267640610, Mod=new int[43]{ 0,0,0,0,0,3,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,3,0,1,1,1,0,0,4 } },
        new VehicleInfo(){ Name="DeathBike2", DisplayName="西部 科幻丧尸", Hash=2482017624, Mod=new int[43]{ 0,0,0,0,0,6,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,3,0,1,1,1,0,0,18 } },
        new VehicleInfo(){ Name="DeathBike3", DisplayName="西部 梦魇丧尸", Hash=2920466844, Mod=new int[43]{ 0,0,0,0,0,3,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,3,0,1,1,1,0,0,4 } },
        new VehicleInfo(){ Name="Defiler", DisplayName="诗津 亵渎者", Hash=822018448, Mod=new int[43]{ 2,2,1,0,4,3,0,1,0,0,4,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Diablous", DisplayName="普林西比 蒂雅布萝", Hash=4055125828, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Diablous2", DisplayName="普林西比 蒂雅布萝改装版", Hash=1790834270, Mod=new int[43]{ 10,11,11,0,6,0,0,0,0,7,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,14,0,0,0,0,0,0,2,9,0,0,0,0,8,0,0,18 } },
        new VehicleInfo(){ Name="Double", DisplayName="丁卡 双 T", Hash=2623969160, Mod=new int[43]{ 0,0,0,0,1,1,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Enduro", DisplayName="丁卡 恩斗罗", Hash=1753414259, Mod=new int[43]{ 0,0,0,0,2,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Esskey", DisplayName="佩嘉西 爱时吉", Hash=2035069708, Mod=new int[43]{ 1,4,2,0,4,0,0,4,0,0,4,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Faggio", DisplayName="佩嘉西 费甲欧现代版", Hash=2452219115, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Faggio2", DisplayName="佩嘉西 费甲欧", Hash=55628203, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Faggio3", DisplayName="佩嘉西 费甲欧摩登版", Hash=3005788552, Mod=new int[43]{ 4,3,3,2,0,9,9,6,20,7,6,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="FCR", DisplayName="佩嘉西 FCR 1000", Hash=627535535, Mod=new int[43]{ 0,3,2,0,3,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="FCR2", DisplayName="佩嘉西 FCR 1000 改装版", Hash=3537231886, Mod=new int[43]{ 13,10,8,0,6,0,0,0,5,1,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,5,0,0,0,0,0,0,7,2,0,0,0,0,7,0,0,18 } },
        new VehicleInfo(){ Name="Gargoyle", DisplayName="西部 石像鬼", Hash=741090084, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="Hakuchou", DisplayName="诗津 白鸟", Hash=1265391242, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Hakuchou2", DisplayName="诗津 白鸟竞速版", Hash=4039289119, Mod=new int[43]{ 0,6,0,0,4,2,0,0,0,0,2,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Hexer", DisplayName="LCC 迷魅光轮", Hash=301427732, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Innovation", DisplayName="LCC 创新", Hash=4135840458, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Lectro", DisplayName="普林西比 雷克卓", Hash=640818791, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Manchez", DisplayName="麦霸子 曼切兹", Hash=2771538552, Mod=new int[43]{ 0,3,1,0,3,2,0,1,0,0,3,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Manchez2", DisplayName="麦霸子 曼切兹侦查", Hash=1086534307, Mod=new int[43]{ 4,2,0,0,4,5,0,0,0,0,4,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,20 } },
        new VehicleInfo(){ Name="Nemesis", DisplayName="普林西比 复仇女神", Hash=3660088182, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Nightblade", DisplayName="西部 夜刃", Hash=2688780135, Mod=new int[43]{ 0,2,0,3,4,2,0,0,3,0,4,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Oppressor", DisplayName="佩嘉西 暴君", Hash=884483972, Mod=new int[43]{ 1,1,1,0,0,1,0,2,1,0,1,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="Oppressor2", DisplayName="佩嘉西 暴君 Mk 2", Hash=2069146067, Mod=new int[43]{ 0,0,0,0,0,1,2,0,0,0,2,4,3,0,0,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30 } },
        new VehicleInfo(){ Name="PCJ", DisplayName="诗津 PCJ 600", Hash=3385765638, Mod=new int[43]{ 0,2,1,0,2,2,1,0,0,0,1,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="RatBike", DisplayName="西部 破烂摩托车", Hash=1873600305, Mod=new int[43]{ 11,4,3,9,7,3,0,5,8,2,7,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Reever", DisplayName="西部 里弗", Hash=1993851908, Mod=new int[43]{ 6,9,7,0,4,5,13,0,0,0,0,5,4,4,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="RRocket", DisplayName="西部 狂暴火箭", Hash=916547552, Mod=new int[43]{ 0,0,0,0,0,4,0,0,0,0,0,4,3,4,58,0,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Ruffian", DisplayName="佩嘉西 恶霸", Hash=3401388520, Mod=new int[43]{ 0,1,1,0,2,1,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Sanchez", DisplayName="麦霸子 桑切斯（涂装版）", Hash=788045382, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Sanchez2", DisplayName="麦霸子 桑切斯", Hash=2841686334, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Sanctus", DisplayName="LCC 圣驹", Hash=1491277511, Mod=new int[43]{ 12,2,2,8,3,3,0,0,0,0,5,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,18 } },
        new VehicleInfo(){ Name="Shinobi", DisplayName="长崎 信奴比", Hash=1353120668, Mod=new int[43]{ 0,3,0,3,4,3,0,3,0,0,0,5,4,4,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Shotaro", DisplayName="长崎 圣太郎", Hash=3889340782, Mod=new int[43]{ 0,1,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Sovereign", DisplayName="西部 君主", Hash=743478836, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Stryder", DisplayName="长崎 斯特德", Hash=301304410, Mod=new int[43]{ 0,0,5,0,5,0,0,0,0,0,0,4,3,3,58,0,5,40,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Thrust", DisplayName="丁卡 猛冲", Hash=1836027715, Mod=new int[43]{ 0,0,0,0,1,1,0,0,0,0,1,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Vader", DisplayName="诗津 威德", Hash=4154065143, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Vindicator", DisplayName="丁卡 审判者", Hash=2941886209, Mod=new int[43]{ 0,1,0,0,5,1,0,0,0,0,1,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Vortex", DisplayName="佩嘉西 漩涡", Hash=3685342204, Mod=new int[43]{ 5,6,0,2,1,3,0,2,2,0,1,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Wolfsbane", DisplayName="西部 恶狼克星", Hash=3676349299, Mod=new int[43]{ 11,4,3,9,7,3,0,5,8,2,7,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,18 } },
        new VehicleInfo(){ Name="ZombieA", DisplayName="西部 鞭尸者", Hash=3285698347, Mod=new int[43]{ 11,4,2,9,8,3,0,4,8,0,7,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,18 } },
        new VehicleInfo(){ Name="ZombieB", DisplayName="西部 碎尸者", Hash=3724934023, Mod=new int[43]{ 11,4,2,9,8,3,0,4,8,0,7,4,3,3,58,0,5,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,18 } },
    };

    /// <summary>
    /// 9 当前分类: 越野车
    /// </summary>
    public static List<VehicleInfo> Offroad = new()
    {
        new VehicleInfo(){ Name="BfInjection", DisplayName="毕福 沙丘征服者", Hash=1126868326, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Bifta", DisplayName="毕福 必浮塔", Hash=3945366167, Mod=new int[43]{ 3,0,0,1,3,1,0,0,0,0,2,4,3,3,58,0,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Blazer", DisplayName="长崎 烈焰", Hash=2166734073, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Blazer2", DisplayName="长崎 烈焰救生型", Hash=4246935337, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Blazer3", DisplayName="长崎 火辣烈焰", Hash=3025077634, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Blazer4", DisplayName="长崎 街头烈焰", Hash=3854198872, Mod=new int[43]{ 4,6,2,4,5,2,4,0,6,3,2,4,3,3,58,0,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Blazer5", DisplayName="长崎 水陆烈焰骑士", Hash=2704629607, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Bodhi2", DisplayName="卡尼斯 万用行者", Hash=2859047862, Mod=new int[43]{ 0,2,2,0,0,3,4,6,4,0,5,4,3,3,58,0,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Brawler", DisplayName="旋风 斗殴者", Hash=2815302597, Mod=new int[43]{ 0,2,2,0,0,1,0,0,0,0,3,4,3,3,58,5,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Bruiser", DisplayName="贝飞特 末日捍士", Hash=668439077, Mod=new int[43]{ 3,0,0,0,4,3,3,13,1,5,3,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,6,0,0,0,0,4,3,6,1,0,2,0,0,4 } },
        new VehicleInfo(){ Name="Bruiser2", DisplayName="贝飞特 科幻捍士", Hash=2600885406, Mod=new int[43]{ 2,1,1,0,4,3,3,7,0,5,3,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,4,3,6,1,0,2,0,0,18 } },
        new VehicleInfo(){ Name="Bruiser3", DisplayName="贝飞特 梦魇捍士", Hash=2252616474, Mod=new int[43]{ 3,0,0,0,4,3,3,13,1,5,3,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,6,0,0,0,0,4,3,6,1,0,2,0,0,4 } },
        new VehicleInfo(){ Name="Brutus", DisplayName="绝致 末日布鲁图斯", Hash=2139203625, Mod=new int[43]{ 0,3,3,2,5,3,3,3,2,5,4,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,2,0,0,0,0,4,3,7,0,1,2,0,0,4 } },
        new VehicleInfo(){ Name="Brutus2", DisplayName="绝致 科幻布鲁图斯", Hash=2403970600, Mod=new int[43]{ 0,1,2,2,1,3,1,2,1,5,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,4,3,7,0,1,2,0,0,18 } },
        new VehicleInfo(){ Name="Brutus3", DisplayName="绝致 梦魇布鲁图斯", Hash=2038858402, Mod=new int[43]{ 0,3,3,2,5,3,3,3,2,5,4,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,2,0,0,0,0,4,3,7,0,1,2,0,0,4 } },
        new VehicleInfo(){ Name="Caracara", DisplayName="威皮 卡拉卡拉", Hash=1254014755, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,1,4,3,3,58,0,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,20 } },
        new VehicleInfo(){ Name="Caracara2", DisplayName="威皮 卡拉卡拉四驱车", Hash=2945871676, Mod=new int[43]{ 9,7,5,0,2,0,3,8,3,0,2,4,3,4,58,5,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="DLoader", DisplayName="冒险家 越野游侠", Hash=1770332643, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Draugur", DisplayName="绝致 德劳古尔", Hash=3526730918, Mod=new int[43]{ 3,18,2,10,9,6,6,0,5,6,2,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,9 } },
        new VehicleInfo(){ Name="Dubsta3", DisplayName="贝飞特 迪布达 6x6", Hash=3057713523, Mod=new int[43]{ 0,6,2,0,0,0,3,2,0,0,4,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dune", DisplayName="毕福 沙丘魔宝", Hash=2633113103, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dune2", DisplayName="太空码头工", Hash=534258863, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dune3", DisplayName="毕福 沙丘 FAV", Hash=1897744184, Mod=new int[43]{ 0,0,0,2,0,2,0,0,0,1,2,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="Dune4", DisplayName="斜面魔宝", Hash=3467805257, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dune5", DisplayName="斜面魔宝", Hash=3982671785, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Everon", DisplayName="卡林 埃弗伦", Hash=2538945576, Mod=new int[43]{ 1,10,2,2,2,0,0,23,0,7,17,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Freecrawler", DisplayName="卡尼斯 自由攀登者", Hash=4240635011, Mod=new int[43]{ 0,3,3,11,3,4,10,7,1,0,2,4,3,3,58,0,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8 } },
        new VehicleInfo(){ Name="Hellion", DisplayName="爱尼仕 恶人", Hash=3932816511, Mod=new int[43]{ 3,16,10,9,8,4,10,0,9,0,3,4,3,4,58,3,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Insurgent", DisplayName="HVY 叛乱分子皮卡", Hash=2434067162, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Insurgent2", DisplayName="HVY 叛乱分子", Hash=2071877360, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Insurgent3", DisplayName="HVY 叛乱分子皮卡改装版", Hash=2370534026, Mod=new int[43]{ 0,0,0,0,0,3,0,0,0,1,1,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="Kalahari", DisplayName="卡尼斯 卡拉哈里", Hash=92612664, Mod=new int[43]{ 0,2,1,1,1,0,0,1,0,0,0,4,3,3,58,0,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Kamacho", DisplayName="卡尼斯 卡马乔", Hash=4173521127, Mod=new int[43]{ 9,12,8,4,4,5,3,8,2,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Menacer", DisplayName="HVY 威胁者", Hash=2044532910, Mod=new int[43]{ 0,14,8,16,12,1,9,21,0,0,4,4,3,3,58,0,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30 } },
        new VehicleInfo(){ Name="Marshall", DisplayName="雪佛 马绍尔", Hash=1233534620, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Mesa3", DisplayName="卡尼斯 炎魔", Hash=2230595153, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Monster", DisplayName="威皮 解放者", Hash=3449006043, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Monster3", DisplayName="冒险家 末日大脚怪", Hash=1721676810, Mod=new int[43]{ 0,3,2,0,2,3,0,3,0,5,0,4,3,3,58,0,5,38,0,0,0,0,0,0,0,0,0,0,0,6,0,0,0,0,4,3,6,0,0,1,0,0,4 } },
        new VehicleInfo(){ Name="Monster4", DisplayName="冒险家 科幻大脚怪", Hash=840387324, Mod=new int[43]{ 0,3,2,0,2,3,0,3,0,5,0,4,3,3,58,0,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,4,3,6,0,0,1,0,0,18 } },
        new VehicleInfo(){ Name="Monster5", DisplayName="冒险家 梦魇大脚怪", Hash=3579220348, Mod=new int[43]{ 0,3,2,0,2,3,0,3,0,5,0,4,3,3,58,0,5,38,0,0,0,0,0,0,0,0,0,0,0,6,0,0,0,0,4,3,6,0,0,1,0,0,4 } },
        new VehicleInfo(){ Name="NightShark", DisplayName="HVY 夜鲨", Hash=433954513, Mod=new int[43]{ 0,3,3,0,2,3,9,10,3,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="Outlaw", DisplayName="长崎 不法之徒", Hash=408825843, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,20 } },
        new VehicleInfo(){ Name="Patriot3", DisplayName="巨象 爱国者军用版", Hash=3624880708, Mod=new int[43]{ 3,10,7,10,6,1,16,7,7,1,9,4,3,3,58,4,5,38,0,0,0,0,9,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,1,0,0,10 } },
        new VehicleInfo(){ Name="RancherXL", DisplayName="绝致 蓝彻 XL", Hash=1645267888, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="RancherXL2", DisplayName="绝致 蓝彻 XL", Hash=1933662059, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="RCBandito", DisplayName="RC 匪徒", Hash=4008920556, Mod=new int[43]{ 0,0,0,0,0,20,0,0,1,2,0,4,3,0,58,0,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,0,0,0,0,0,0,8 } },
        new VehicleInfo(){ Name="Rebel", DisplayName="卡林 叛逆男女生锈版", Hash=3087195462, Mod=new int[43]{ 0,2,0,0,0,0,0,0,0,0,5,4,3,3,58,0,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Rebel2", DisplayName="卡林 叛逆男女", Hash=2249373259, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Riata", DisplayName="威皮 利雅塔", Hash=2762269779, Mod=new int[43]{ 0,10,3,4,3,0,2,8,0,0,11,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Sandking", DisplayName="威皮 大脚霸王 XL", Hash=3105951696, Mod=new int[43]{ 0,4,0,2,0,4,2,0,0,0,1,4,3,3,58,5,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Sandking2", DisplayName="威皮 大脚霸王 SWB", Hash=989381445, Mod=new int[43]{ 0,4,0,2,0,4,2,0,0,0,1,4,3,3,58,5,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Technical", DisplayName="卡林 铁尼高", Hash=2198148358, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Technical2", DisplayName="卡林 水陆铁尼高", Hash=1180875963, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Technical3", DisplayName="卡林 铁尼高改装版", Hash=1356124575, Mod=new int[43]{ 0,0,0,0,0,3,5,0,0,1,1,4,3,4,58,3,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="TrophyTruck", DisplayName="威皮 越野卡车", Hash=101905590, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,5,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="TrophyTruck2", DisplayName="威皮 沙漠突击", Hash=3631668194, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,5,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="Vagrant", DisplayName="麦克斯韦 流浪者", Hash=740289177, Mod=new int[43]{ 0,0,0,0,8,2,2,2,3,3,2,4,3,3,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30 } },
        new VehicleInfo(){ Name="Verus", DisplayName="丁卡 维鲁斯", Hash=298565713, Mod=new int[43]{ 3,0,0,0,3,2,2,6,0,0,0,4,3,3,58,5,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,20 } },
        new VehicleInfo(){ Name="Winky", DisplayName="威皮 威起", Hash=4084658662, Mod=new int[43]{ 3,7,2,6,4,10,4,6,3,0,1,4,3,3,58,2,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,29 } },
        new VehicleInfo(){ Name="Yosemite3", DisplayName="绝致 约塞米蒂蓝彻", Hash=67753863, Mod=new int[43]{ 7,14,5,6,5,4,9,14,5,15,5,4,3,3,58,4,5,35,0,0,0,0,45,0,14,2,10,16,15,0,0,2,0,4,5,0,7,6,2,10,8,2,18 } },
        new VehicleInfo(){ Name="Zhaba", DisplayName="卢恩 炸吧", Hash=1284356689, Mod=new int[43]{ 6,3,3,8,9,3,6,0,2,2,6,4,3,2,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30 } },
    };

    /// <summary>
    /// 10 当前分类: 工业用车
    /// </summary>
    public static List<VehicleInfo> Industrial = new()
    {
        new VehicleInfo(){ Name="Bulldozer", DisplayName="HVY 推土机", Hash=1886712733, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cutter", DisplayName="HVY 钻洞机", Hash=3288047904, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dump", DisplayName="HVY 矿石搬运车", Hash=2164484578, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Flatbed", DisplayName="MTL 平板拖车", Hash=1353720154, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Guardian", DisplayName="威皮 守护者", Hash=2186977100, Mod=new int[43]{ 0,0,0,0,1,0,0,0,0,0,0,4,3,3,58,5,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Handler", DisplayName="码头装卸车", Hash=444583674, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Mixer", DisplayName="HVY 混凝土搅拌车", Hash=3510150843, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Mixer2", DisplayName="HVY 混凝土搅拌车", Hash=475220373, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Rubble", DisplayName="乔氏 砂通天", Hash=2589662668, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TipTruck", DisplayName="威霸 工地倾卸车", Hash=48339065, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TipTruck2", DisplayName="工地倾卸车", Hash=3347205726, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 11 当前分类: 公共事业用车
    /// </summary>
    public static List<VehicleInfo> Utility = new()
    {
        new VehicleInfo(){ Name="Airtug", DisplayName="行李拖车", Hash=1560980623, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="ArmyTanker", DisplayName="军用拖车", Hash=3087536137, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="ArmyTrailer", DisplayName="军用拖车", Hash=2818520053, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="ArmyTrailer2", DisplayName="军用拖车", Hash=2657817814, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="BaleTrailer", DisplayName="草捆拖车", Hash=3895125590, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="BoatTrailer", DisplayName="拖船", Hash=524108981, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Caddy", DisplayName="高尔夫球车", Hash=1147287684, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Caddy2", DisplayName="高尔夫球车", Hash=3757070668, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Caddy3", DisplayName="高尔夫球车", Hash=3525819835, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="DockTrailer", DisplayName="NULL", Hash=2154757102, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Docktug", DisplayName="码头拖车", Hash=3410276810, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Forklift", DisplayName="HVY 叉车", Hash=1491375716, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="FreightTrailer", DisplayName="NULL", Hash=3517691494, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="GrainTrailer", DisplayName="NULL", Hash=1019737494, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Mower", DisplayName="割草车", Hash=1783355638, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="PropTrailer", DisplayName="NULL", Hash=356391690, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="RakeTrailer", DisplayName="拖车", Hash=390902130, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Ripley", DisplayName="机场牵引车", Hash=3448987385, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Sadler", DisplayName="威皮 沙德勒", Hash=3695398481, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Sadler2", DisplayName="威皮 沙德勒", Hash=734217681, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Scrap", DisplayName="废五金回收车", Hash=2594165727, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Slamtruck", DisplayName="威皮 大满贯卡车", Hash=3249056020, Mod=new int[43]{ 0,7,0,3,3,0,9,4,0,8,0,4,3,3,58,0,5,38,4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,18 } },
        new VehicleInfo(){ Name="Tanker", DisplayName="拖车", Hash=3564062519, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tanker2", DisplayName="NULL", Hash=1956216962, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TowTruck", DisplayName="拖吊车", Hash=2971866336, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TowTruck2", DisplayName="拖吊车", Hash=3852654278, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TR2", DisplayName="拖车", Hash=2078290630, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TR3", DisplayName="拖车", Hash=1784254509, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TR4", DisplayName="拖车", Hash=2091594960, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tractor", DisplayName="老式拖拉机", Hash=1641462412, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tractor2", DisplayName="斯坦利 农耕机", Hash=2218488798, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tractor3", DisplayName="斯坦利 农耕机", Hash=1445631933, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TrailerLarge", DisplayName="机动作战中心", Hash=1502869817, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,2,4,3,4,58,3,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,9 } },
        new VehicleInfo(){ Name="TrailerLogs", DisplayName="拖车", Hash=2016027501, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Trailers", DisplayName="拖车", Hash=3417488910, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Trailers2", DisplayName="拖车", Hash=2715434129, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Trailers3", DisplayName="拖车", Hash=2236089197, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Trailers4", DisplayName="拖车", Hash=3194418602, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TrailerSmall", DisplayName="拖车", Hash=712162987, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TRFlat", DisplayName="拖车", Hash=2942498482, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TVTrailer", DisplayName="拖车", Hash=2524324030, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="UtilityTruck", DisplayName="公共事业卡车", Hash=516990260, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="UtilityTruck2", DisplayName="公共事业卡车", Hash=887537515, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="UtilityTruck3", DisplayName="公共事业卡车", Hash=2132890591, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 12 当前分类: 厢型车
    /// </summary>
    public static List<VehicleInfo> Vans = new()
    {
        new VehicleInfo(){ Name="Bison", DisplayName="冒险家 野牛", Hash=4278019151, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Bison2", DisplayName="冒险家 野牛", Hash=2072156101, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Bison3", DisplayName="冒险家 野牛", Hash=1739845664, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="BobcatXL", DisplayName="威皮 雄猫 XL", Hash=1069929536, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Boxville", DisplayName="威霸 厢村", Hash=2307837162, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Boxville2", DisplayName="厢村", Hash=4061868990, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Boxville3", DisplayName="威霸 厢村", Hash=121658888, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Boxville4", DisplayName="威霸 厢村", Hash=444171386, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Boxville5", DisplayName="装甲版厢村", Hash=682434785, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Burrito", DisplayName="绝致 屌客", Hash=2948279460, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Burrito2", DisplayName="绝致 除虫大师屌客", Hash=3387490166, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Burrito3", DisplayName="绝致 屌客", Hash=2551651283, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Burrito4", DisplayName="绝致 屌客", Hash=893081117, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Burrito5", DisplayName="绝致 屌客", Hash=1132262048, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Camper", DisplayName="威霸 露营车", Hash=1876516712, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="GBurrito", DisplayName="绝致 屌客帮派版", Hash=2549763894, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="GBurrito2", DisplayName="绝致 屌客帮派版", Hash=296357396, Mod=new int[43]{ 1,1,1,0,3,0,2,5,0,0,2,4,3,3,58,5,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Journey", DisplayName="赛柯尼 安旅者", Hash=4174679674, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Minivan", DisplayName="威皮 迷你厢型车", Hash=3984502180, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Minivan2", DisplayName="威皮 迷你厢型车改装版", Hash=3168702960, Mod=new int[43]{ 1,0,0,0,1,0,1,0,0,0,3,4,3,3,58,0,5,50,6,13,16,4,45,0,14,5,1,16,15,22,0,9,4,4,3,0,0,0,0,0,0,0,9 } },
        new VehicleInfo(){ Name="Paradise", DisplayName="冒险家 天堂", Hash=1488164764, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Pony", DisplayName="威霸 小马", Hash=4175309224, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Pony2", DisplayName="威霸 小马", Hash=943752001, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Rumpo", DisplayName="冒险家 澜波", Hash=1162065741, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Rumpo2", DisplayName="冒险家 澜波", Hash=2518351607, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Rumpo3", DisplayName="冒险家 澜波改装版", Hash=1475773103, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Speedo", DisplayName="威皮 劲速", Hash=3484649228, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Speedo2", DisplayName="威皮 小丑花车", Hash=728614474, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Speedo4", DisplayName="威皮 劲速改装版", Hash=219613597, Mod=new int[43]{ 0,0,0,0,0,3,0,0,0,1,3,4,3,3,58,0,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30 } },
        new VehicleInfo(){ Name="Surfer", DisplayName="毕福 乘风", Hash=699456151, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Surfer2", DisplayName="毕福 乘风", Hash=2983726598, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Taco", DisplayName="玉米饼餐车", Hash=1951180813, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Youga", DisplayName="冒险家 游侠", Hash=65402552, Mod=new int[43]{ 0,3,0,0,1,1,0,1,0,0,2,4,3,3,58,3,5,48,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Youga2", DisplayName="冒险家 游侠经典版", Hash=1026149675, Mod=new int[43]{ 1,0,0,1,1,1,0,0,0,0,1,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,12 } },
        new VehicleInfo(){ Name="Youga3", DisplayName="冒险家 游侠经典四驱车", Hash=1802742206, Mod=new int[43]{ 8,4,6,5,6,1,7,9,0,4,3,4,3,3,58,4,5,36,0,0,0,15,0,4,0,7,1,16,0,0,0,8,0,6,0,0,5,1,5,6,4,3,16 } },
        new VehicleInfo(){ Name="Youga4", DisplayName="威皮 游侠改装版", Hash=1486521356, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 13 当前分类: 自行车
    /// </summary>
    public static List<VehicleInfo> Cycles = new()
    {
        new VehicleInfo(){ Name="Bmx", DisplayName="BMX", Hash=1131912276, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cruiser", DisplayName="巡航者", Hash=448402357, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Fixter", DisplayName="费斯特", Hash=3458454463, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Scorcher", DisplayName="先驱者", Hash=4108429845, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TriBike", DisplayName="惠比特竞速自行车", Hash=1127861609, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TriBike2", DisplayName="极限耐力竞速自行车", Hash=3061159916, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TriBike3", DisplayName="特莱赛可竞速自行车", Hash=3894672200, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 14 当前分类: 船
    /// </summary>
    public static List<VehicleInfo> Boats = new()
    {
        new VehicleInfo(){ Name="Avisa", DisplayName="海怪 阿维萨", Hash=2588363614, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dinghy", DisplayName="长崎 小艇", Hash=1033245328, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dinghy2", DisplayName="长崎 小艇", Hash=276773164, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dinghy3", DisplayName="长崎 小艇", Hash=509498602, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dinghy4", DisplayName="长崎 小艇", Hash=867467158, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dinghy5", DisplayName="长崎 武装小艇", Hash=3314393930, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Jetmax", DisplayName="诗津 极限快艇", Hash=861409633, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Kosatka", DisplayName="卢恩 虎鲸", Hash=1336872304, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,5,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,46 } },
        new VehicleInfo(){ Name="Longfin", DisplayName="诗津 长鳍", Hash=1861786828, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Marquis", DisplayName="丁卡 水上侯爵", Hash=3251507587, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="PatrolBoat", DisplayName="库尔兹 31 巡逻艇", Hash=4018222598, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Predator", DisplayName="警用追猎快艇", Hash=3806844075, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Seashark", DisplayName="水上枭雄 海鲨摩托艇", Hash=3264692260, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Seashark2", DisplayName="水上枭雄 海鲨摩托艇", Hash=3678636260, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Seashark3", DisplayName="水上枭雄 海鲨摩托艇", Hash=3983945033, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Speeder", DisplayName="佩嘉西 飙速", Hash=231083307, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Speeder2", DisplayName="佩嘉西 飙速", Hash=437538602, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Squalo", DisplayName="诗津 思快乐快艇", Hash=400514754, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Submersible", DisplayName="潜水艇", Hash=771711535, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Submersible2", DisplayName="海怪", Hash=3228633070, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Suntrap", DisplayName="诗津 向阳号", Hash=4012021193, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Toro", DisplayName="兰帕达缇 公牛", Hash=1070967343, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Toro2", DisplayName="兰帕达缇 公牛", Hash=908897389, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tropic", DisplayName="诗津 烈阳号", Hash=290013743, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tropic2", DisplayName="诗津 烈阳号", Hash=1448677353, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tug", DisplayName="拖船", Hash=2194326579, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 15 当前分类: 直升机
    /// </summary>
    public static List<VehicleInfo> Helicopters = new()
    {
        new VehicleInfo(){ Name="Akula", DisplayName="阿库拉", Hash=1181327175, Mod=new int[43]{ 0,0,0,0,0,2,0,0,0,4,1,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="Annihilator", DisplayName="歼灭者", Hash=837858166, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Annihilator2", DisplayName="歼灭者隐形版", Hash=295054921, Mod=new int[43]{ 0,0,0,0,0,2,0,0,0,0,0,4,3,3,58,5,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,20 } },
        new VehicleInfo(){ Name="Buzzard", DisplayName="秃鹰攻击直升机", Hash=788747387, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Buzzard2", DisplayName="秃鹰直升机", Hash=745926877, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cargobob", DisplayName="运兵直升机", Hash=4244420235, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cargobob2", DisplayName="运兵直升机", Hash=1621617168, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cargobob3", DisplayName="运兵直升机", Hash=1394036463, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cargobob4", DisplayName="运兵直升机", Hash=2025593404, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Conada", DisplayName="白金汉 康纳达", Hash=3817135397, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Frogger", DisplayName="穿梭者", Hash=744705981, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Frogger2", DisplayName="穿梭者", Hash=1949211328, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Havok", DisplayName="长崎 浩劫者", Hash=2310691317, Mod=new int[43]{ 0,2,0,0,0,0,0,0,0,0,1,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8 } },
        new VehicleInfo(){ Name="Hunter", DisplayName="FH-1 猎杀者", Hash=4252008158, Mod=new int[43]{ 0,2,0,0,0,0,0,0,0,4,1,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8 } },
        new VehicleInfo(){ Name="Maverick", DisplayName="小蛮牛", Hash=2634305738, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Polmav", DisplayName="警用小蛮牛", Hash=353883353, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Savage", DisplayName="野蛮人", Hash=4212341271, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="SeaSparrow", DisplayName="海雀", Hash=3568198617, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,2,4,3,3,58,5,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="SeaSparrow2", DisplayName="麻雀", Hash=1229411063, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,2,4,3,0,58,5,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="SeaSparrow3", DisplayName="麻雀", Hash=1593933419, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,2,4,3,0,58,5,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Skylift", DisplayName="吊挂直升机", Hash=1044954915, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Supervolito", DisplayName="白金汉 超级沃利托", Hash=710198397, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Supervolito2", DisplayName="白金汉 超级沃利托碳纤版", Hash=2623428164, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Swift2", DisplayName="白金汉 斯威夫特豪华版", Hash=1075432268, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Swift", DisplayName="白金汉 斯威夫特", Hash=3955379698, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Valkyrie", DisplayName="女武神", Hash=2694714877, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Valkyrie2", DisplayName="女武神 MOD.0", Hash=1543134283, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Volatus", DisplayName="白金汉 弗拉图斯", Hash=2449479409, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 16 当前分类: 飞机
    /// </summary>
    public static List<VehicleInfo> Planes = new()
    {
        new VehicleInfo(){ Name="Alkonost", DisplayName="RO-86 阿尔科诺斯特", Hash=3929093893, Mod=new int[43]{ 0,2,0,0,0,0,0,0,0,4,0,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="AlphaZ1", DisplayName="白金汉 阿尔法-Z1", Hash=2771347558, Mod=new int[43]{ 0,2,0,0,0,0,0,0,0,0,0,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8 } },
        new VehicleInfo(){ Name="Avenger", DisplayName="巨象 复仇者", Hash=2176659152, Mod=new int[43]{ 0,2,0,0,0,0,0,0,0,4,2,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="Avenger2", DisplayName="巨象 复仇者", Hash=408970549, Mod=new int[43]{ 0,2,0,0,0,0,0,0,0,4,2,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="Besra", DisplayName="西部 雀鹰", Hash=1824333165, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Blimp", DisplayName="原子飞艇", Hash=4143991942, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Blimp2", DisplayName="希罗飞艇", Hash=3681241380, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Blimp3", DisplayName="飞艇", Hash=3987008919, Mod=new int[43]{ 0,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,20 } },
        new VehicleInfo(){ Name="Bombushka", DisplayName="RM-10 邦布什卡", Hash=4262088844, Mod=new int[43]{ 0,2,0,0,1,1,0,0,0,4,1,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="CargoPlane", DisplayName="货机", Hash=368211810, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cuban800", DisplayName="古邦 800", Hash=3650256867, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,4,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Dodo", DisplayName="巨象 嘟嘟鸟", Hash=3393804037, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Duster", DisplayName="洒药机", Hash=970356638, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Howard", DisplayName="白金汉 霍华德 NX-25", Hash=3287439187, Mod=new int[43]{ 0,2,0,0,0,0,0,0,0,0,0,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Hydra", DisplayName="巨象 九头蛇", Hash=970385471, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Jet", DisplayName="喷气机", Hash=1058115860, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Lazer", DisplayName="P-996 天煞", Hash=3013282534, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Luxor", DisplayName="白金汉 乐梭", Hash=621481054, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Luxor2", DisplayName="白金汉 乐梭豪华版", Hash=3080673438, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Mammatus", DisplayName="天行巨兽", Hash=2548391185, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Microlight", DisplayName="长崎 鸿毛", Hash=2531412055, Mod=new int[43]{ 0,2,0,0,2,0,0,0,0,0,1,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Miljet", DisplayName="白金汉 军用喷气机", Hash=165154707, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Mogul", DisplayName="巨象 莫古尔", Hash=3545667823, Mod=new int[43]{ 0,2,0,0,1,1,0,0,0,4,1,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8 } },
        new VehicleInfo(){ Name="Molotok", DisplayName="V-65 莫洛托克", Hash=1565978651, Mod=new int[43]{ 0,2,0,1,0,0,0,0,0,0,1,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,20 } },
        new VehicleInfo(){ Name="Nimbus", DisplayName="白金汉 灵气号", Hash=2999939664, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Nokota", DisplayName="P-45 诺克塔", Hash=1036591958, Mod=new int[43]{ 0,2,0,1,0,0,0,0,0,0,1,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Pyro", DisplayName="白金汉 狂焰", Hash=2908775872, Mod=new int[43]{ 0,2,0,0,0,0,0,0,0,0,1,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Rogue", DisplayName="西部 恶徒", Hash=3319621991, Mod=new int[43]{ 0,2,0,0,0,1,0,0,0,4,2,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Seabreeze", DisplayName="西部 海风", Hash=3902291871, Mod=new int[43]{ 0,2,0,0,0,0,0,0,0,4,1,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8 } },
        new VehicleInfo(){ Name="Shamal", DisplayName="白金汉 夏玛尔客机", Hash=3080461301, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Starling", DisplayName="LF-22 星椋", Hash=2594093022, Mod=new int[43]{ 0,2,0,0,1,0,0,0,0,4,1,4,3,1,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Strikeforce", DisplayName="B-11 突击部队", Hash=1692272545, Mod=new int[43]{ 0,2,0,0,0,0,0,0,0,4,0,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,11 } },
        new VehicleInfo(){ Name="Stunt", DisplayName="野鸭", Hash=2172210288, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Titan", DisplayName="泰坦号", Hash=1981688531, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tula", DisplayName="巨象 图拉", Hash=1043222410, Mod=new int[43]{ 0,2,0,0,1,0,0,0,0,4,2,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8 } },
        new VehicleInfo(){ Name="Velum", DisplayName="梅杜莎", Hash=2621610858, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Velum2", DisplayName="梅杜莎 5 座", Hash=1077420264, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Vestra", DisplayName="白金汉 威斯特拉", Hash=1341619767, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Volatol", DisplayName="沃拉托", Hash=447548909, Mod=new int[43]{ 0,2,0,0,0,0,0,0,0,4,0,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
    };

    /// <summary>
    /// 17 当前分类: 服务用车
    /// </summary>
    public static List<VehicleInfo> Service = new()
    {
        new VehicleInfo(){ Name="Airbus", DisplayName="机场巴士", Hash=1283517198, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Brickade", DisplayName="MTL 布里凯德", Hash=3989239879, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Bus", DisplayName="巴士", Hash=3581397346, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Coach", DisplayName="白狗巴士", Hash=2222034228, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="PBus2", DisplayName="音乐节巴士", Hash=345756458, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,4,58,3,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="RallyTruck", DisplayName="MTL 沙丘", Hash=2191146052, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,5,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2 } },
        new VehicleInfo(){ Name="RentalBus", DisplayName="租用穿梭巴士", Hash=3196165219, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Taxi", DisplayName="出租车", Hash=3338918751, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Tourbus", DisplayName="观光巴士", Hash=1941029835, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Trash", DisplayName="垃圾大王", Hash=1917016601, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Trash2", DisplayName="垃圾大王", Hash=3039269212, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Wastelander", DisplayName="MTL 拓荒者", Hash=2382949506, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 18 当前分类: 特种车
    /// </summary>
    public static List<VehicleInfo> Emergency = new()
    {
        new VehicleInfo(){ Name="Ambulance", DisplayName="救护车", Hash=1171614426, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="FBI", DisplayName="FIB", Hash=1127131465, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="FBI2", DisplayName="FIB", Hash=2647026068, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="FireTruck", DisplayName="MTL 消防车", Hash=1938952078, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Lguard", DisplayName="绝致 沙滩急救车", Hash=469291905, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="PBus", DisplayName="移监巴士", Hash=2287941233, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Police", DisplayName="警用巡逻车", Hash=2046537925, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Police2", DisplayName="警用巡逻车", Hash=2667966721, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Police3", DisplayName="警用巡逻车", Hash=1912215274, Mod=new int[43]{ 2,2,2,2,1,2,0,2,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Police4", DisplayName="无标识巡航者", Hash=2321795001, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Policeb", DisplayName="警用摩托车", Hash=4260343491, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,72,72,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="PoliceOld1", DisplayName="警用蓝彻", Hash=2758042359, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="PoliceOld2", DisplayName="警用公路巡逻车", Hash=2515846680, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="PoliceT", DisplayName="警用运输车", Hash=456714581, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Pranger", DisplayName="国家公园警用车", Hash=741586030, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Riot", DisplayName="警用防暴车", Hash=3089277354, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Riot2", DisplayName="防暴车", Hash=2601952180, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,1,4,3,3,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="Sheriff", DisplayName="警长座车", Hash=2611638396, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,36,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Sheriff2", DisplayName="警长 SUV", Hash=1922257928, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,38,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 19 当前分类: 军用车
    /// </summary>
    public static List<VehicleInfo> Military = new()
    {
        new VehicleInfo(){ Name="Apc", DisplayName="HVY APC", Hash=562680400, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,1,1,4,3,3,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="Barracks", DisplayName="地霸王", Hash=3471458123, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Barracks2", DisplayName="HVY 拖车型地霸王", Hash=1074326203, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Barracks3", DisplayName="地霸王", Hash=630371791, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Barrage", DisplayName="巴拉杰", Hash=4081974053, Mod=new int[43]{ 2,10,10,4,20,30,8,22,12,9,1,4,3,3,58,0,5,50,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="Chernobog", DisplayName="切尔诺伯格", Hash=3602674979, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="Crusader", DisplayName="卡尼斯 傲世铁骑", Hash=321739290, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="HalfTrack", DisplayName="冒险家 半履战车", Hash=4262731174, Mod=new int[43]{ 0,0,0,0,0,3,0,0,0,1,1,4,3,0,58,0,5,35,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="Khanjari", DisplayName="TM-02 可汗贾利", Hash=2859440138, Mod=new int[43]{ 0,0,0,0,0,1,0,0,0,1,1,4,3,0,58,0,5,50,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="MiniTank", DisplayName="入侵与说服 坦克", Hash=3040635986, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,3,4,4,0,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Rhino", DisplayName="犀牛坦克", Hash=782665360, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Scarab", DisplayName="HVY 末日圣甲虫", Hash=3147997943, Mod=new int[43]{ 0,8,0,11,4,3,2,0,0,5,7,4,3,0,58,0,5,50,0,0,0,0,6,0,0,0,0,0,0,7,0,0,0,0,4,3,6,3,0,2,0,0,4 } },
        new VehicleInfo(){ Name="Scarab2", DisplayName="HVY 科幻圣甲虫", Hash=1542143200, Mod=new int[43]{ 0,10,4,16,3,3,4,0,0,5,7,4,3,0,58,0,5,50,0,0,0,0,6,0,0,0,0,0,0,0,0,0,0,0,4,3,6,2,0,2,0,0,18 } },
        new VehicleInfo(){ Name="Scarab3", DisplayName="HVY 梦魇圣甲虫", Hash=3715219435, Mod=new int[43]{ 0,8,0,11,4,3,2,0,0,5,7,4,3,0,58,0,5,50,0,0,0,0,6,0,0,0,0,0,0,7,0,0,0,0,4,3,6,3,0,2,0,0,4 } },
        new VehicleInfo(){ Name="Thruster", DisplayName="巨象 推进者", Hash=1489874736, Mod=new int[43]{ 0,2,0,0,1,0,0,0,0,0,2,4,3,0,0,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="TrailerSmall2", DisplayName="冯·伏厄 防空拖车", Hash=2413121211, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,2,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,40 } },
        new VehicleInfo(){ Name="Vetir", DisplayName="维泰尔", Hash=2014313426, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 20 当前分类: 商用车
    /// </summary>
    public static List<VehicleInfo> Commercial = new()
    {
        new VehicleInfo(){ Name="Benson", DisplayName="威皮 班森", Hash=2053223216, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Biff", DisplayName="HVY 倾卸车", Hash=850991848, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Cerberus", DisplayName="MTL 末日地狱犬", Hash=3493417227, Mod=new int[43]{ 0,0,3,0,11,3,7,5,0,5,1,4,3,4,58,5,5,50,0,0,0,0,0,0,0,0,0,0,0,10,0,0,0,0,4,3,6,1,0,0,0,0,4 } },
        new VehicleInfo(){ Name="Cerberus2", DisplayName="MTL 科幻地狱犬", Hash=679453769, Mod=new int[43]{ 0,0,3,0,7,3,7,5,0,5,1,4,3,4,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,4,0,0,0,0,4,3,6,1,0,0,0,0,18 } },
        new VehicleInfo(){ Name="Cerberus3", DisplayName="MTL 梦魇地狱犬", Hash=1909700336, Mod=new int[43]{ 0,0,3,0,11,3,7,5,0,5,1,4,3,4,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,10,0,0,0,0,4,3,6,1,0,0,0,0,4 } },
        new VehicleInfo(){ Name="Hauler", DisplayName="乔氏 搬运者", Hash=1518533038, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Hauler2", DisplayName="乔氏 搬运者改装版", Hash=387748548, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Mule", DisplayName="麦霸子 猛骡", Hash=904750859, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Mule2", DisplayName="麦霸子 猛骡", Hash=3244501995, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Mule3", DisplayName="麦霸子 猛骡", Hash=2242229361, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Mule4", DisplayName="麦霸子 猛骡改装版", Hash=1945374990, Mod=new int[43]{ 0,2,0,0,0,3,0,0,0,1,1,4,3,3,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30 } },
        new VehicleInfo(){ Name="Mule5", DisplayName="麦霸子 猛骡", Hash=1343932732, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Packer", DisplayName="MTL 车辆运送车", Hash=569305213, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Phantom", DisplayName="乔氏 魅影", Hash=2157618379, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Phantom2", DisplayName="乔氏 尖锥魅影", Hash=2645431192, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Phantom3", DisplayName="乔氏 魅影改装版", Hash=177270108, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Pounder", DisplayName="MTL 跑德", Hash=2112052861, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Pounder2", DisplayName="MTL 跑德改装版", Hash=1653666139, Mod=new int[43]{ 1,0,1,0,0,3,0,0,0,1,3,4,3,3,58,0,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,30 } },
        new VehicleInfo(){ Name="Stockade", DisplayName="威霸 拦截者", Hash=1747439474, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Stockade3", DisplayName="威霸 拦截者", Hash=4080511798, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Terrorbyte", DisplayName="贝飞特 恐霸", Hash=2306538597, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,4,3,3,58,4,5,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 21 当前分类: 火车
    /// </summary>
    public static List<VehicleInfo> Trains = new()
    {
        new VehicleInfo(){ Name="CableCar", DisplayName="缆车", Hash=3334677549, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="Freight", DisplayName="货运列车", Hash=1030400667, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="FreightCar", DisplayName="货运列车", Hash=184361638, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="FreightCar2", DisplayName="货运列车", Hash=3186376089, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="FreightCont1", DisplayName="货运列车", Hash=920453016, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="FreightCont2", DisplayName="货运列车", Hash=240201337, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="FreightGrain", DisplayName="货运列车", Hash=642617954, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="MetroTrain", DisplayName="货运列车", Hash=868868440, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
        new VehicleInfo(){ Name="TankerCar", DisplayName="货运列车", Hash=586013744, Mod=new int[43]{ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,50,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 } },
    };

    /// <summary>
    /// 22 当前分类: 开轮式
    /// </summary>
    public static List<VehicleInfo> OpenWheel = new()
    {
        new VehicleInfo(){ Name="Formula", DisplayName="培罗 PR4", Hash=340154634, Mod=new int[43]{ 12,6,0,7,1,0,5,0,0,0,0,4,4,4,58,0,5,140,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="Formula2", DisplayName="欧斯洛 R88", Hash=2334210311, Mod=new int[43]{ 9,7,0,5,0,0,0,0,0,0,3,4,4,4,58,0,5,140,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="OpenWheel1", DisplayName="贝飞特 BR8", Hash=1492612435, Mod=new int[43]{ 6,4,0,4,3,0,0,0,0,0,0,4,4,3,58,4,5,140,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
        new VehicleInfo(){ Name="OpenWheel2", DisplayName="绝致 DR1", Hash=1181339704, Mod=new int[43]{ 5,7,0,4,3,6,5,0,3,0,5,4,4,4,58,0,5,140,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10 } },
    };

    /// <summary>
    /// 载具分类
    /// </summary>
    public static List<VehicleClass> VehicleClassData = new()
    {
        /*
             0 当前分类: 小型汽车
             1 当前分类: 轿车
             2 当前分类: SUV
             3 当前分类: 轿跑车
             4 当前分类: 肌肉车
             5 当前分类: 经典跑车
             6 当前分类: 跑车
             7 当前分类: 超级跑车
             8 当前分类: 摩托车
             9 当前分类: 越野车
            10 当前分类: 工业用车
            11 当前分类: 公共事业用车
            12 当前分类: 厢型车
            13 当前分类: 自行车
            14 当前分类: 船
            15 当前分类: 直升机
            16 当前分类: 飞机
            17 当前分类: 服务用车
            18 当前分类: 特种车
            19 当前分类: 军用车
            20 当前分类: 商用车
            21 当前分类: 火车
            22 当前分类: 开轮式
         */
        new VehicleClass(){ ClassName="★常用载具", VehicleInfo=CommonVehicle },
        new VehicleClass(){ ClassName="小型汽车", VehicleInfo=Compacts },
        new VehicleClass(){ ClassName="轿车", VehicleInfo=Sedans },
        new VehicleClass(){ ClassName="SUV", VehicleInfo=SUVs },
        new VehicleClass(){ ClassName="轿跑车", VehicleInfo=Coupes },
        new VehicleClass(){ ClassName="肌肉车", VehicleInfo=Muscle },
        new VehicleClass(){ ClassName="经典跑车", VehicleInfo=SportsClassics },
        new VehicleClass(){ ClassName="跑车", VehicleInfo=Sports },
        new VehicleClass(){ ClassName="超级跑车", VehicleInfo=Super },
        new VehicleClass(){ ClassName="摩托车", VehicleInfo=Motorcycles },
        new VehicleClass(){ ClassName="越野车", VehicleInfo=Offroad },
        new VehicleClass(){ ClassName="工业用车", VehicleInfo=Industrial },
        new VehicleClass(){ ClassName="公共事业用车", VehicleInfo=Utility },
        new VehicleClass(){ ClassName="厢型车", VehicleInfo=Vans },
        new VehicleClass(){ ClassName="自行车", VehicleInfo=Cycles },
        new VehicleClass(){ ClassName="船", VehicleInfo=Boats },
        new VehicleClass(){ ClassName="直升机", VehicleInfo=Helicopters },
        new VehicleClass(){ ClassName="飞机", VehicleInfo=Planes },
        new VehicleClass(){ ClassName="服务用车", VehicleInfo=Service },
        new VehicleClass(){ ClassName="特种车", VehicleInfo=Emergency },
        new VehicleClass(){ ClassName="军用车", VehicleInfo=Military },
        new VehicleClass(){ ClassName="商用车", VehicleInfo=Commercial },
        new VehicleClass(){ ClassName="火车", VehicleInfo=Trains },
        new VehicleClass(){ ClassName="开轮式", VehicleInfo=OpenWheel }
    };
}
